<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ArabicToolsSeeder extends Seeder
{
    public function run()
    {
        $tools = [
            'أدوات النصب',
            'أدوات الجزم',
            'أدوات الشرط الجازمة',
            'أدوات الشرط غير الجازمة',
            'أدوات الاستفهام',
            'أدوات النفي',
            'أدوات التوكيد',
            'أدوات العطف',
            'أدوات الاستدراك',
            'أدوات الحصر والقصر',
            'أدوات النداء',
            'أحرف القسم',
            'أدوات الاستثناء',
            'أدوات التفضيل',
            'أدوات المفاجأة',
            'أدوات الحال',
            'أدوات الترجي والتوقع',
            'أدوات التحضيض والتمني',
            'أدوات العرض والتحضيض',
            'أدوات التفسير',
            'أدوات التحذير والإغراء',
            'أدوات الدعاء',
            'أدوات التفصيل',
            'أدوات السببية',
            'أدوات التهديد والوعيد',
            'أدوات التوكيد اللفظي'
        ];

        foreach ($tools as $tool) {
            DB::table('arabic_tools')->insert([
                'name' => $tool
            ]);
        }
    }
}
