<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class BasmalaSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('basmalas')->insert([
            'formula' => 'بِسْمِ ٱللَّهِ ٱلرَّحْمَنِ ٱلرَّحِيمِ',
            'placement' => 'إذا ابتدأت بأول سورة من سور القرآن الكريم فلا بد من الإتيان بالبسملة ما عدا أول "براءة"، وتسمى سورة "التوبة" – أيضا.  وإذا ابتدأت بما بعد أوائل السور ولو بكلمة فأنت مخير بين الإتيان بالبسملة وبين عدم الإتيان بها. وهل "براءة" كذلك؟ جوَّز بعضهم الإتيان بالبسملة وتركها كغيرها من السور، ومنع الجعبري البسملة في أي جزء من أجزائها تبعاً لأولها. ',
            'forms_of_bismillah' => 'الأول: قطع الجميع. 
الثاني: قطع آخر السورة عن البسملة مع وصل البسملة بأول السورة. 
الثالث: وصل الجميع.  وأما وصل آخر السورة بالبسملة مع الوقف عليها فلا يجوز؛ لأن البسملة جعلت لأوائل السور لا لأواخرها. 
وهذه الأوجه الثلاثة جائزة بين كل سورتين، سواء أكانتا مرتبتين أم غير مرتبتين.  ويستثنى من ذلك بين الأنفال والتوبة، فإن بينهما لجميع القراء ثلاثة أوجه وهي: الوقف، والسكت، والوصل بدون بسملة. 
وبين الأنفال وبين التوبــة        قـف واسكتن وصـل بلا بسملة ',
            'created_at' => now(),
            'updated_at' => now(),
        ]);
    }
}
