<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class NunSakinahAndTanweenSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('nun_sakinah_and_tanween_rules')->insert
        ([
            [
            'category_id' => 1, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الإظهار الحلقي',
            'ruling_description' => 'الإظهار: هو إخراج الحرف الساكن من مخرجه من غير وقف ولا سكت ولا تشديد.',
            'ruling_letters' => 'الهمزة والهاء والعين والحاء والغين والخاء، وهي مجموعة في أوائل الكلمات التالية: ( أخي هاك علماً حازهُ غير خاسر ). وتسمى هذه الحروف حروف الحلق، لأن مخرجها هو الحلق، ولذا سمي الحكم: الإظهار الحلقي.',
            'pronunciation_method' => 'نظهر النون الساكنة أو التنوين قبل:(الهمزة والهاء والعين والحاء والغين والخاء).',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 1, // Reference to the "tajweed_categories" table
            'ruling_name' => ' الإدغام',
            'ruling_description' => 'هو دمج النون الساكنة أو التنوين بحرف من حروف الإدغام بحيث يصيران حرفاً واحداً مشدداً، هو حرف الإدغام. ',
            'ruling_letters' => 'حروف إدغام النون ستة: تجمعها كلمة (يرملون). القسم الأول: الإدغام بغنة: يكون عند التقاء النون الساكنة أو التنوين عند أحرف كلمة : ( ينمو).   القسم الثاني: الإدغام بلا غنة: يكون عندما تقع النون الساكنة أو التنوين قبل حرف اللام والراء، ',
            'pronunciation_method' => 'أن تدغم النون فلا تقرأ، بل يشدد الحرف الذي يليها، وتظهر الغنة على هذا الحرف المشدد مقدار حركتين',
            'example' => 'ن + ي: ِنْ يَرَوْا، فِئَةٌ يَنصُرُونَهُ وتقرآن: " أيّروا "، " فِئَتينْصرونه".',
            'note' => ' إذا وقع حرف الإدغام بعد النون الساكنة في كلمة واحدة، فلا يصح الإدغام، بل يجب إظهار النون الساكنة وقد وقع ذلك في القرآن بأربع كلمات هي: دُنْيا، قنْوان ، بُنْيان، صِنْوان. ',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 1, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الإقلاب',
            'ruling_description' => 'هو قلب النون الساكنة أو التنوين ميماً قبل الباء مع مراعاة الغنة.',
            'ruling_letters' => 'الباء',
            'pronunciation_method' => 'عند ورود نون ساكنة أو تنوين وبعد هما باء، سواء في كلمة واحدة أو كلمتين، تقرأ النون ميماً، يبقى صوت الغنة على الميم مقدار حركتين.',
            'example' => '',
            'note' => 'It is important to differentiate between the tanween and the letter when pronouncing.',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 1, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الإخفاء',
            'ruling_description' => 'هو حالة بين الإظهار و الإدغام عار عن التشديد مع بقاء الغنة في الحرف الأول.',
            'ruling_letters' => 'سائر حروف الهجاء عدا حروف الإظهار، والإدغام، وحرف الإقلاب وهي مجموعة في أوائل البيت التالي: [صِفْ ذَا ثَنَاكَمْ جَاء شخصٌ قد سَمَا دمٌ طيباً زدْ في تقىً ضعْ ظالماً].',
            'pronunciation_method' => 'عند ورود حرف الإخفاء بعد النون الساكنة أو التنوين تلفظ النون مسموعة من الأنف ولا تشدد، ولا يشدد حرف الإخفاء الذي يليها ',
            'example' => 'ويكون الإخفاء في كلمة أو كلمتين مثاله: 
                ص: انْصُرْنا،ولمن صَبَرَ،بريح صَرْصَر، ونخيلٌ صِوان.
                ذ: منذ، من ذا، وكيلاً ذريةً، ظل ذي. ',
                            'note' => 'عند إجراء عملية الإخفاء نحاول أن نُخرج الإخفاء من مخرج الحرف الذي يلي النون الساكنة أو التنوين، ومعرفة مخرج الحرف تكون بوضع الهمزة قبل هذا الحرف وتسكين الحرف. 
                مثال: أصْ، أذْ، أثْ، أكْ، أجْ، أشْ ، أقْ ، أسْ ، أدْ، أطْ، أزْ، أفْ، أتْ، أضْ،أظْ.
                يأخذ الإخفاء صفة الحرف الذي يلي النون الساكنة، يعني هذا أن الإخفاء يكون مفخما إذا كان الحرف الذي يلي النون الساكنة أو التنوين مفخماً. مثاله:  من طيبات.
                وإذا كان الحرف الذي يلي النون الساكنة أو التنوين مرققاً، فعندئذ يكون الإخفاء مرققا. مثاله:  من ذا الذي.',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
                'category_id' => 2, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الإخفاء الشفوي',
                'ruling_description' => 'هو أن تأتي الميم الساكنة في آخر الكلمة، ويأتي بعدها حرف الباء، فعندئذ تخفى الميم الساكنة بالباء مع بقاء الغنة.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'وهمْ بالآخرة، ترميهمْ بحجارة، أنتمْ به.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],

                // ========================================== الميم الساكنة ====================================
            [
                'category_id' => 2, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الإدغام الشفوي',
                'ruling_description' => 'هو أن تأتي آخر الكلمة ميم ساكنة وتأتي بعدها ميما متحركة، فعندئذ تدغم الميم الساكنة بالمتحركة لتصبحا ميما واحدة مشددة تظهر عليها الغنة.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' في قلوبهم مرض تقرأ: " في قلوبهمّرض." جاءكم من، تقرأ: " جاءكمِّن" ، أزواجهم مثل تقرأ: " أزواجهمّثل.".',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 2, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الإظهار الشفوي',
                'ruling_description' => 'هو أن يأتي بعد حرف الميم الساكنة حروف الهجاء ما عدا الباء والميم في كلمة واحدة أو في كلمتين. ويكون أشد إظهاراً بعد الواو أو الفاء، لاتحاد مخرج الميم مع الواو، وقرب مخرجها مع الفاء..',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' ذلكم خير لكم، وإن كنتم على، ولكم فيها، عليهم ولا الضالين،عليهم فيها، ذلكم حكم..".',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],

                
            //======================= ادغام المتجانسين والمتقاربين ====================================

            [
                'category_id' => 3, // Reference to the "tajweed_categories" table
                'ruling_name' => 'إدغام المتماثلين',
                'ruling_description' => 'إذا التقى حرفان متماثلان أولهما ساكن والثاني متحرك أدغم الأول في الثاني...',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '  ما لكم من،من نزّل،بل لا،ما كانت تعبد،اضرب بعصاك، اذهب بكتابي، يدرككم، إذْ ذَهَبَ...".',
                'note' => '1- يجوز الإدغام والإظهار مع السكت. 
                    والإظهار أرجح في قوله: مَا أَغْنَى عَنِّي مَالِيَه * هَلَكَ عَنِّي سُلْطَانِيَه [الحاقة: 28-29].
                    فتقرأ على الإدغام " ما لِيهّلَكَ " أو تظهر ماليهْ * هلك ويوقف على الهاء الأولى وقفة خفيفة من غير قطع نفس.
                    2- إذا كان الحرف الأول واواً أو ياءً وبعدهما مثلهما متحركان فلا إدغام فيهما. 
                    مثاله: آمنوا وعملوا، الذي يوسوس.
                    3- وأما إذا كان الأول حرف لين، فيدغم في المماثل.
                    مثاله: والذين آووا ونصروا فتقرأ: "آوَوّ نصروا".',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 3, // Reference to the "tajweed_categories" table
                'ruling_name' => 'إدغام المتجانسين',
                'ruling_description' => 'ويكون عندما يتفق الحرفان مخرجا ويختلفان صفة..',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' - التاء الساكنة تدغم التاء الساكنة- بلا غنة- في موضعين: إذا جاء بعدها دال أو طاء.
                    1.  ت+ د أثقلت دعوا تقرأ: " أثقلَتْدَّعَوا." أجيبتْ دعوتكما تقرأ: " أُجيبَدَّعوتكما"
                    2.  ت+ ط: همت طائفتان تقرأ: هَمّطَّائفتان". قالت طائفة تقرأ: قالَطَّائفة". 
                    ب- الدال الساكنة: تدغم الدال الساكنة - بلا غنة - إذا جاء بعدها تاء.
                    مثاله: د+ ت: قدْ تَبَين تقرأ: " قَتَّبين" ، وومَهّدْتُ تقرأ: " ومَهّتّ. لقد كِدْت تقرأ: " لقدْكِتَّ "
                    جـ- الباء الساكنة: تدغم الباء الساكنة في الميم بعدها مع مراعاة الغنة في مكان واحد في القرآن هو:  يا بني اركبْ معنا [هود:42] تقرأ: "اركمّعنا ". 
                    د- الذال الساكنة: تدغم الذال الساكنة -بلا غنة- إذا جاء بعدها حرف الظاء: 
                    مثاله:  ذ + ظ: إذ ظلمتم تقرأ " إظَّلَمْتم ". 
                    هـ - الثاء الساكنة: تدغم الثاء الساكنة -بلا غنة- إذا جاء بعدها حرف الذال. 
                    مثاله: ث + ذ: يلهثْ ذلك تقرأ: " يلهثّذَّلك ".
                    و- الطاء الساكنة: تدغم الطاء الساكنة - بلا غنة - إذا جاء بعدها تاء.
                    مثاله: ط+ ت: أحطّت تقرأ: " أحَتُّ ". بسطت. تقرأ: " بسَتّ " فرطتم تقرأ: " فرَتّم ".".',
                'note' => 'تبقى في هذه الحالة صفة التفخيم للطاء المدغمة ومن أجل ذلك يسمى إدغاماً ناقصاً.',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 3, // Reference to the "tajweed_categories" table
                'ruling_name' => 'إدغام المتقاربين',
                'ruling_description' => 'إذا تقارب الحرفان مخرجاً وصفة، وكان الأول منهما ساكناً، وجب إدغامه في الثاني - بلا غنة - وذلك في حالتين.',
                'ruling_letters' => 'اللام في الراء: مثل: قلْ رب تقرأ: " قُرَّب "
                    2.  القاف مع الكاف: مثل: المْ نخلقْكُم تقرأ: " نَخْلُكّمْ ". يجوز في هذه الحالة إبقاء صفة تفخيم القاف فيكون الإدغام ناقصاً أو حذف هذه الصفة ويكون الإدغام كاملاً.
                    "وتظهر جميع الأحرف الساكنة التي لم ترد لها أحكام خاصة عند بعضها البعض، وينبغي الانتباه إلى إظهار ما يلي: 
                    1.  الضاد الساكنة عند الطاء في نحو: ممن اضطر. 
                    2.  الضاد الساكنة عند التاء في نحو: فإذا أفضتم. 
                    3.  الظاء الساكنة عند التاء في نحو: سواءٌ علينا أوَعظت. 
                    4.  الدال الساكنة عند الكاف، نحو: لقدْ كدت."',
                'pronunciation_method' => '',
                'example' => ' ذلكم خير لكم، وإن كنتم على، ولكم فيها، عليهم ولا الضالين،عليهم فيها، ذلكم حكم..".',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],

            // ============================= اللامات السواكن =====================================


            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => 'لام أل',
                'ruling_description' => 'وهي لام التعريف ، ولها قبل حروف الهجاء حالتان: حالة يجب فيها الإظهار، وحالة يجب فيها الإدغام..',
                'ruling_letters' => '',
                'pronunciation_method' => 'فيجب إظهارها إذا وقع بعدها حرف من الحروف الأربعة عشر المجموعة في: "ابغ حجك وخف عقيمه". . ويجب إدغامها إذا وقع بعدها حرف من الحروف الأربعة عشر الباقية من حروف الهجاء',
                'example' => 'الإِنْسَانُ  الْبَارِئُ  الْغَنِيُّ  الْحَكِيمُ  الْجَمِيلَ  الْكَرِيمِ  الْوَلِيُّ الْخَبِيرُ  الْفَتَّاحُ  الْعُلَمَاءُ  الْقَيُّومُ  الْيَوْمَ  الْمُلْكُ  الْهُدَى . ... لطَّيِّبَاتُ  الثَّوَابِ  الصَّالِحِينَ  الرَّزَّاقُ  التَّائِبُونَ  الضَّالِّينَ  الذَّكَرُ  النَّعِيمِ  الدَّاعِ  السَّمِيعُ  الظَّالِمِينَ  الزَّبُورِ  الشَّكُورُ اللَّيْلِ ، ويسمى هذا النوع من الإدغام إدغاما شمسيا، وتسمى هذه اللام لاما شمسية. .',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => 'لام الحرف',
                'ruling_description' => 'وهي في "هل" و "بل" وحكمها الإظهار .. إلا إذا وقع بعدها لام أو راء؛ فإنها تدغم فيهما كاللام في "قل"',
                'ruling_letters' => 'اللام و الراء',
                'pronunciation_method' => '',
                'example' => '',
                'note' => 'كما يستثنى من قاعدة إدغام لام الحرف بَلْ رَانَ في المطففين آية 14؛ فإن حكمها الإظهار لحفص من طريق الشاطبية؛ لوجود السكت على اللام، والسكت مانع من الإدغام',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => ' لام الاسم',
                'ruling_description' => '',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' سُلْطَانٍ ، أَلْسِنَتُكُمُ ، عِلْمًا ، سَلْسَبِيلا ',
                'note' => 'وحكمها الإظهار مطلقا',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => 'لام الأمر',
                'ruling_description' => 'وهي من أدوات جزم المضارع',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'وَلْيَكْتُب بَّيْنَكُمْ  وَلْيُوفُوا نُذُورَهُمْ ',
                'note' => 'وحكمها الإظهار مطلقا',
                'created_at' => now(),
                'updated_at' => now(),
                ],

        // =============================== madud ====================================


        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد الطبيعي أو الأصلي',
                'ruling_description' => 'هو ما لا تقوم ذات الحرف إلا به، ولا يتوقف على سبب همز بعده أو سكون.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' نوحيها. ومقدار مده حركتان، ولا يجوز الزيادة أو النقصان عن الحركتين. ',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد الفرعي',
                'ruling_description' => 'هو ما زاد على المد الأصلي، ويكون بسبب اجتماع حرف المد بهمز بعده أو سكون. فالهمز والسكون سببان للمد الفرعي، فعليه يكون 
                    المد الفرعي نوعان: مد بسبب الهمز، ومد بسبب السكون. ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد بسبب الهمز',
                'ruling_description' => 'إن كان الهمز قبل حرف المد فيسمى 
                        مد البدل: وسمي بدلاً لأن حرف المد فيه بُدل من الهمزة الساكنة.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' ءامنوا، أيماناً، أُوتوا.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد المتصل',
                'ruling_description' => 'هو أن يأتي حرف المد والهمز بعده في كلمة واحدة ويسمى المد الواجب المتصل. ويمد خمس حركات. 
                    المد الفرعي نوعان: مد بسبب الهمز، ومد بسبب السكون. ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' إذا جاء نصر الله والفتح ،  وأحاطت به خطيئته،  سُوءَ العذاب.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد المنفصل',
                'ruling_description' => 'هو أن يأتي حرف المد في آخر كلمة، والهمز بعده في كلمة أخرى تليها، ويسمى المد الجائز. ويمد خمس حركات، ونستطيع أن نقصره إلى حركتين.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' يا أيها ،  الذي أنزل ،  توبوآ إلى الله .',
                'note' => ' يمنع مد الألف في كلمة ( أنا ) حيثما وجد إلا في حالة الوقف، نحو: قال أنا أحي وأميت، وأنا أعلم.',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد بسبب سكون عارض',
                'ruling_description' => 'وهو أن يكون الحرف قبل الأخير من الكلمة حرف مد، والحرف الأخير متحرك، فإن درجنا الكلام ووصلنا الكلمة بما بعدها كان المد طبيعياً، وإن وقفنا على الحرف الأخير بالسكون صار المد الذي قبل الحرف الأخير مداً بسبب السكون العارض ويسمى:مداً عارضاً للسكون. يمد ست حركات، أو أربع، أو حركتان .',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' إن الله شديد العقاب}، قد أفلح المؤمنون، الحمد لله رب العالمين. ',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد بسبب سكون لازم',
                'ruling_description' => 'وهو أن يأتي بعد الحرف المد سكون لازم وصلاً ووقفاً في كلمة واحدة، ومقدار مده ست حركات.  وهو نوعان: الكلمي والحرفي.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => '(الكلمي) المد بسبب سكون لازم',
                'ruling_description' => 'وهو أن يأتي بعد حرف المد حرف ساكن في كلمة، فإن أدغم (أي كان الحرف الذي بعد المد مشدداً) فيسمى مثقلاً.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' آلذَّكرين، قل ءآللهُ أذِنَ لكم، ءآللهُ خيرٌ أمّا تشركون',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => '(الحرفي) المد بسبب سكون لازم',
                'ruling_description' => 'يوجد في فواتح بعض السور، في الحرف الذي هجاؤه ثلاث أحرف أوسطها حرف مد والثالث ساكن. .',
                'ruling_letters' => 'وحروفه مجموعة في: بل كم قص وهو نوعان',
                'pronunciation_method' => ' فإن أدغم سمي مثقلاً. مثاله: آلم، المر، طسم  وإن لم يدغم سمي مخففاً مثاله: ن والقلم، ق والقرآن، المص',
                'example' => ' آلذَّكرين، قل ءآللهُ أذِنَ لكم، ءآللهُ خيرٌ أمّا تشركون',
                'note' => 'حرف العين في فواتح السور يجوز أن يمد ست حركات، ويجوز أن يمد أربع حركات لأن الياء فيه ليست مدية بل هي حرف لين. ',
                'created_at' => now(),
                'updated_at' => now(),
                ],

                
           // ============================= لواحق المد =============================
           
           [
            'category_id' => 5, // Reference to the "tajweed_categories" table
            'ruling_name' => 'مد العوض',
            'ruling_description' => 'ويكون عند الوقف على التنوين المنصوب في آخر الكلمة، فيقرأ ألفاً عوضاً عن التنوين، ويمد مقدار حركتين، وإذا لم يوقف عليه فلا يمد.',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => 'أجراً عظيماً، عفواً غفوراً، إلا قليلاً.',
            'note' => 'يشترط في هذا المد أن يكون الحرف المنوّن غير التاء المربوطة والألف المقصورة.',
            'created_at' => now(),
            'updated_at' => now(),
            ],

            [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'مد التمكين',
                'ruling_description' => 'هو ياءان أولاهما مشددة مكسورة والثانية ساكنة، وسمي مد تمكين لأنه يخرج متمكناً بسبب الشدة، ويمد مقدار حركتين. .',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'حُييتم، النبيين.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'مد اللين',
                'ruling_description' => 'وهو مد حرفي المد: الياء والواو الساكنتان، المفتوح ما قبلها، والساكن ما بعدها سكوناً عارضاً في حالة الوقف. ويمد حركتين أو أربع، أو ست. .',
                'ruling_letters' => 'الياء والواو الساكنتان، المفتوح ما قبلها، والساكن ما بعدها سكوناً عارضاً في حالة الوقف',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'مد الصلة الكبرى',
                'ruling_description' => 'وهو مد هاء الضمير الغائب المفرد المذكر مضمومة أو مكسوره الواقعة بين متحركين (أي أن الحرف الذي قبلها من نفس الكلمة كان متحركاً والحرف الذي بعدها من الكلمة التي تليها كان متحركاً أيضاً) تشبع ضمه الهاء ليتولد عنها واو مدية أو تشبع كسرة الهاء ليتولد عنها ياء مدية، وتمد خمس حركات، ونستطيع أن نقصرها إلى حركتين كالمنفصل، وذلك إذا جاء بعدها همز. ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' وهو يحاوره أنا، وله أجر، به أحداً.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'مد الصلة الصغرى',
                'ruling_description' => 'وهو مد هاء الضمير الغائب المفرد المذكر… وتمد مقدار حركتين إن لم يأتي بعدها همز.. ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'أعّذبه عذاباً، قلته فقد علمته، بكلمته ويقطع. ويستثنى منه فلا يمد: يرضه لكم [الزمر: 7].',
                'note' => ' تقرأ: فيه مهانا [الفرقان: 69] ، بمد صلة على خلاف القياس مع أنها لم تقع بين متحركتين. ',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            

        // =============================== احكام الراء ===========================================
            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => 'تفخيم الراء',
                'ruling_description' => 'هو سِمَن يدخل على صوت الحرف حتى يمتلئ الفم بصداه. ',
                'ruling_letters' => ' إذا كانت مفتوحة أو مضمومة , ذا كانت ساكنة وقبلها فتح أو ضم  , إذا كانت ساكنة وقبلها كسر عارض ,  ذا كانت ساكنة وقبلها كسر أصلي وبعدها حرف استعلاء غير مكسور في كلمة واحدة ',
                'pronunciation_method' => 'ينبغي الاحتراز عن التكرير في لفظ الراء . وكيفية الاحتراز عن التكرير بأن تلصق ظهر اللسان بأعلى الحنك لصقاً محكماً وتلفظ الراء مرة واحدة.',
                'example' => ' رَبّنا , خردل , ارْجِعوا إلى أبيكم , مِرْصادا',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            
            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => 'ترقيق الراء',
                'ruling_description' => 'هو النطق بالحرف نحيفاً غير ممتلئ الفم بصداه. ',
                'ruling_letters' => ' إذا كانت مكسورة , إذا كانت ساكنة وقبلها ياء ساكنة , إذا كانت ساكنة وقبلها كسر (ولا عبرة للسكون الفاصل) وليس بعدها حرف استعلاء غير مكسور',
                'pronunciation_method' => 'ينبغي الاحتراز عن التكرير في لفظ الراء . وكيفية الاحتراز عن التكرير بأن تلصق ظهر اللسان بأعلى الحنك لصقاً محكماً وتلفظ الراء مرة واحدة.',
                'example' => 'رِزقاً , خيْر، قديْر ,  أنِذرهم، فِرْعون، مِريْة، السِّحْر',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],

            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => 'جواز تفخيم او ترقيق الراء',
                'ruling_description' => ' إذا سكنت الراء في آخر الكلمة وكان الساكن الفاصل بينهما وبين الكسر حرف مفخّم ساكن او إذا كانت الراء ساكنة وقبلها كسر أصلي وبعدها حرف استعلاء مكسور ففيها الوجهان او  في حالة الوقف على هذه الكلمات: فأسْرِ، أن أسرِ حيثما وردت في القرآن. وكلمة يَسْر. وكلمة وَنُذْر ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => 'حروف الاستعلاء من حيث قوة التفخيم على الترتيب التالي: الطاء ، فالضاد، فالصاد، فالظاء، فالقاف، فالغين، وفالخاء. وأقوى تفخيماً إذا كان حرف الاستعلاء مفتوحاً، بعده ألف نحو: طائفة ثم المفتوح وليس بعده ألف نحو: طَبَعَ، ثم المضموم نحو: طُوبَا، ثم المكسور نحو: طِبتُم.',
                'created_at' => now(),
                'updated_at' => now(),
                ],

            // احكام متفرفة =================================================


            [
                'category_id' => 8, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الروم',
                'ruling_description' => 'هو إضعاف الصوت بالحركة ( الضمة أو الكسرة) حتى يذهب معظم صوتها، فيسمع لها صوت خفي يسمعه القريب المصغي دون البعيد، لأنها غير تامة.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 8, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الاشمام',
                'ruling_description' => 'هو ضم الشفتين بُعَيْدَ الإسكان إشارة إلى الضم مع بعض انفراج بينهما ليخرج منه النفس، ولا يدرك لغير البصير. لأنه يسمع ولا يرى.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'وتشم النون في قوله تعالى: يَا أَبَانَا مَا لَكَ لا تَأْمَنَّا عَلَى يُوسُفَ [يوسف: 11] إشعارا بحذف حركة النون الأولى: تأمننا.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 8, // Reference to the "tajweed_categories" table
                'ruling_name' => 'السكتات',
                'ruling_description' => 'السكت هو قطع الصوت عند القراءة بدون تنفس بمقدار حركتين، ويجب السكت في أربعة مواضع على قراءة حفص.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' وَلَمْ يَجْعَلْ لَهُ عِوَجَا * قَيِّمًا لِيُنذِرَ بَأْسًا…الآية [الكهف: 1-2] ..  قَالُوا يَا وَيْلَنَا مَنْ بَعَثَنَا مِنْ مَرْقَدِنَا هَذَا مَا وَعَدَ الرَّحْمَانُ [يس: 52] ..  وَقِيلَ مَنْ رَاقٍ [القيامة :27] ..  كَلا بَلْ رَانَ عَلَى قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ [المطففين: 14] .. .',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            
            

   ] );
    }
}
