<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class NunSakinahAndTanweenSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('nun_sakinah_and_tanween_rules')->insert
        ([
            [
            'category_id' => 1, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الإظهار الحلقي',
            'ruling_description' => 'الإظهار: هو إخراج الحرف الساكن من مخرجه من غير وقف ولا سكت ولا تشديد. الهمزة والهاء والعين والحاء والغين والخاء، وهي مجموعة في أوائل الكلمات التالية: ( أخي هاك علماً حازهُ غير خاسر ). وتسمى هذه الحروف حروف الحلق، لأن مخرجها هو الحلق، ولذا سمي الحكم: الإظهار الحلقي ',
            'ruling_letters' => 'الهمزة والهاء والعين والحاء والغين والخاء، وهي مجموعة في أوائل الكلمات التالية: ( أخي هاك علماً حازهُ غير خاسر ). وتسمى هذه الحروف حروف الحلق، لأن مخرجها هو الحلق، ولذا سمي الحكم: الإظهار الحلقي.',
            'pronunciation_method' => 'نظهر النون الساكنة أو التنوين قبل:(الهمزة والهاء والعين والحاء والغين والخاء).',
            'example' => ' ن+ أ : مِنْ أيَاتِنَا، مَنْ أَرَادَ، مَرَّةً أُخْرَى، مِلْحٌ أُجَاجٌ. ,   ن + هـ: عَنْهُمْ، مِنْهُمْ، إِنْ هُمْ , ن + ع: إنْ عُدْنا، أنْعَمْتَ، يومٌ عَسيرٌ،  إثْماً عَظيماً.   ن + ح: منْ حَوْلِهِمْ، شَيءٌ حَفيظٌ ، أُسْوَةٌ حَسَنَة.  ن + غ: مِنْ غَيْرِ، عملٌ غَيْر صالِح، منْ عذابٍ غَليظ.   ن + خ: مَنْ خَلَقَ، كُلَّ شَيْءٍ خَلْقَهُ.  ',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 1, // Reference to the "tajweed_categories" table
            'ruling_name' => ' الإدغام',
            'ruling_description' => 'هو دمج النون الساكنة أو التنوين بحرف من حروف الإدغام بحيث يصيران حرفاً واحداً مشدداً، هو حرف الإدغام. حروف إدغام النون ستة: تجمعها كلمة (يرملون). ينقسم الإدغام إلى قسمين :  القسم الأول: الإدغام بغنة: يكون عند التقاء النون الساكنة أو التنوين عند أحرف كلمة : ( ينمو).  القسم الثاني: الإدغام بلا غنة: يكون عندما تقع النون الساكنة أو التنوين قبل حرف اللام والراء، ',
            'ruling_letters' => 'حروف إدغام النون ستة: تجمعها كلمة (يرملون). القسم الأول: الإدغام بغنة: يكون عند التقاء النون الساكنة أو التنوين عند أحرف كلمة : ( ينمو).   القسم الثاني: الإدغام بلا غنة: يكون عندما تقع النون الساكنة أو التنوين قبل حرف اللام والراء، ',
            'pronunciation_method' => 'أن تدغم النون فلا تقرأ، بل يشدد الحرف الذي يليها، وتظهر الغنة على هذا الحرف المشدد مقدار حركتين',
            'example' => 'ن + ي: ِنْ يَرَوْا، فِئَةٌ يَنصُرُونَهُ وتقرآن: " أيّروا "، " فِئَتينْصرونه".  ن + و: مِنْ وَالٍ، إِيمَانًا وَهُمْ وتقرآن: " مِوَّال "،" إيمانَوَّهم".   ن + م: مِنْ مَاءٍ ، صِرَاطًا مُسْتَقِيمًا وتقرآن: " مِمَّاء " ، " صراطمّسْقيماً ".   ن + ن: إِنْ نَحْنُ، مَلِكًا نُقَاتِلْ وتقرآن: " إنَّحن"، "مَلِكنُّقاتل".',
            'note' => ' إذا وقع حرف الإدغام بعد النون الساكنة في كلمة واحدة، فلا يصح الإدغام، بل يجب إظهار النون الساكنة وقد وقع ذلك في القرآن بأربع كلمات هي: دُنْيا، قنْوان ، بُنْيان، صِنْوان. ',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 1, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الإقلاب',
            'ruling_description' => 'هو قلب النون الساكنة أو التنوين ميماً قبل الباء مع مراعاة الغنة. حرفه: الباء',
            'ruling_letters' => 'الباء',
            'pronunciation_method' => 'عند ورود نون ساكنة أو تنوين وبعد هما باء، سواء في كلمة واحدة أو كلمتين، تقرأ النون ميماً، يبقى صوت الغنة على الميم مقدار حركتين.',
            'example' => 'من بعد تقرأ : " مِمْبَعد ".   بسلطان مبين: تقرأ: " بسلطنمبين ".    سميعٌ بصير: تقرأ: " سميعمبصير ".   بشراً مبين: " تقرأ: " بشرمبين ".   لينبذن: تقرأ: " ليمبَذنّ ".   أنبآء: تقرأ: " أمباء ".  ',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 1, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الإخفاء',
            'ruling_description' => 'هو حالة بين الإظهار و الإدغام عار عن التشديد مع بقاء الغنة في الحرف الأول.',
            'ruling_letters' => 'سائر حروف الهجاء عدا حروف الإظهار، والإدغام، وحرف الإقلاب وهي مجموعة في أوائل البيت التالي: [صِفْ ذَا ثَنَاكَمْ جَاء شخصٌ قد سَمَا دمٌ طيباً زدْ في تقىً ضعْ ظالماً].',
            'pronunciation_method' => 'عند ورود حرف الإخفاء بعد النون الساكنة أو التنوين تلفظ النون مسموعة من الأنف ولا تشدد، ولا يشدد حرف الإخفاء الذي يليها ',
            'example' => 'ويكون الإخفاء في كلمة أو كلمتين مثاله: 
                ص: انْصُرْنا،ولمن صَبَرَ،بريح صَرْصَر، ونخيلٌ صِوان.
                ذ: منذ، من ذا، وكيلاً ذريةً، ظل ذي. ',
                            'note' => 'عند إجراء عملية الإخفاء نحاول أن نُخرج الإخفاء من مخرج الحرف الذي يلي النون الساكنة أو التنوين، ومعرفة مخرج الحرف تكون بوضع الهمزة قبل هذا الحرف وتسكين الحرف. 
                مثال: أصْ، أذْ، أثْ، أكْ، أجْ، أشْ ، أقْ ، أسْ ، أدْ، أطْ، أزْ، أفْ، أتْ، أضْ،أظْ.
                يأخذ الإخفاء صفة الحرف الذي يلي النون الساكنة، يعني هذا أن الإخفاء يكون مفخما إذا كان الحرف الذي يلي النون الساكنة أو التنوين مفخماً. مثاله:  من طيبات.
                وإذا كان الحرف الذي يلي النون الساكنة أو التنوين مرققاً، فعندئذ يكون الإخفاء مرققا. مثاله:  من ذا الذي.',
            'created_at' => now(),
            'updated_at' => now(),
            ],


            // ========================================== الميم الساكنة ====================================
            [
                'category_id' => 2, // Reference to the "tajweed_categories" table
                'ruling_name' => ' حكم الميم',
                'ruling_description' => 'عند لفظ الميم المشددة وفي حال قراءة القرآن الكريم ينبغي إظهار الغنة بمقدار حركتين.
مثال: أمّا، ثمَّ ، عمّ ، أمّن.  عند لفظ النون المشددة ينبغي إظهار الغنة بمقدار حركتين. 
 مثال: إنّ، إنّا، وقوله تعالى:  من الجِنَّة والنّاس ، [سورة الناس: 6 ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' أمّا، ثمَّ ، عمّ ، أمّن.   من الجِنَّة والنّاس',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 2, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الإخفاء الشفوي',
                'ruling_description' => 'هو أن تأتي الميم الساكنة في آخر الكلمة، ويأتي بعدها حرف الباء، فعندئذ تخفى الميم الساكنة بالباء مع بقاء الغنة.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'وهمْ بالآخرة، ترميهمْ بحجارة، أنتمْ به.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],

            [
                'category_id' => 2, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الإدغام الشفوي',
                'ruling_description' => 'هو أن تأتي آخر الكلمة ميم ساكنة وتأتي بعدها ميما متحركة، فعندئذ تدغم الميم الساكنة بالمتحركة لتصبحا ميما واحدة مشددة تظهر عليها الغنة.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' في قلوبهم مرض تقرأ: " في قلوبهمّرض." جاءكم من، تقرأ: " جاءكمِّن" ، أزواجهم مثل تقرأ: " أزواجهمّثل.".',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 2, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الإظهار الشفوي',
                'ruling_description' => 'هو أن يأتي بعد حرف الميم الساكنة حروف الهجاء ما عدا الباء والميم في كلمة واحدة أو في كلمتين. ويكون أشد إظهاراً بعد الواو أو الفاء، لاتحاد مخرج الميم مع الواو، وقرب مخرجها مع الفاء..',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' ذلكم خير لكم، وإن كنتم على، ولكم فيها، عليهم ولا الضالين،عليهم فيها، ذلكم حكم..".',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],

                
            //======================= ادغام المتجانسين والمتقاربين ====================================

            [
                'category_id' => 3, // Reference to the "tajweed_categories" table
                'ruling_name' => 'إدغام المتماثلين',
                'ruling_description' => 'إذا التقى حرفان متماثلان أولهما ساكن والثاني متحرك أدغم الأول في الثاني.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '  ما لكم من،من نزّل،بل لا،ما كانت تعبد،اضرب بعصاك، اذهب بكتابي، يدرككم، إذْ ذَهَبَ...".',
                'note' => '1- يجوز الإدغام والإظهار مع السكت. 
                    والإظهار أرجح في قوله: مَا أَغْنَى عَنِّي مَالِيَه * هَلَكَ عَنِّي سُلْطَانِيَه [الحاقة: 28-29].
                    فتقرأ على الإدغام " ما لِيهّلَكَ " أو تظهر ماليهْ * هلك ويوقف على الهاء الأولى وقفة خفيفة من غير قطع نفس.
                    2- إذا كان الحرف الأول واواً أو ياءً وبعدهما مثلهما متحركان فلا إدغام فيهما. 
                    مثاله: آمنوا وعملوا، الذي يوسوس.
                    3- وأما إذا كان الأول حرف لين، فيدغم في المماثل.
                    مثاله: والذين آووا ونصروا فتقرأ: "آوَوّ نصروا".',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 3, // Reference to the "tajweed_categories" table
                'ruling_name' => 'إدغام المتجانسين',
                'ruling_description' => 'ويكون عندما يتفق الحرفان مخرجا ويختلفان صفة..',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' - التاء الساكنة تدغم التاء الساكنة- بلا غنة- في موضعين: إذا جاء بعدها دال أو طاء.
                    1.  ت+ د أثقلت دعوا تقرأ: " أثقلَتْدَّعَوا." أجيبتْ دعوتكما تقرأ: " أُجيبَدَّعوتكما"
                    2.  ت+ ط: همت طائفتان تقرأ: هَمّطَّائفتان". قالت طائفة تقرأ: قالَطَّائفة". 
                    ب- الدال الساكنة: تدغم الدال الساكنة - بلا غنة - إذا جاء بعدها تاء.
                    مثاله: د+ ت: قدْ تَبَين تقرأ: " قَتَّبين" ، وومَهّدْتُ تقرأ: " ومَهّتّ. لقد كِدْت تقرأ: " لقدْكِتَّ "
                    جـ- الباء الساكنة: تدغم الباء الساكنة في الميم بعدها مع مراعاة الغنة في مكان واحد في القرآن هو:  يا بني اركبْ معنا [هود:42] تقرأ: "اركمّعنا ". 
                    د- الذال الساكنة: تدغم الذال الساكنة -بلا غنة- إذا جاء بعدها حرف الظاء: 
                    مثاله:  ذ + ظ: إذ ظلمتم تقرأ " إظَّلَمْتم ". 
                    هـ - الثاء الساكنة: تدغم الثاء الساكنة -بلا غنة- إذا جاء بعدها حرف الذال. 
                    مثاله: ث + ذ: يلهثْ ذلك تقرأ: " يلهثّذَّلك ".
                    و- الطاء الساكنة: تدغم الطاء الساكنة - بلا غنة - إذا جاء بعدها تاء.
                    مثاله: ط+ ت: أحطّت تقرأ: " أحَتُّ ". بسطت. تقرأ: " بسَتّ " فرطتم تقرأ: " فرَتّم ".".',
                'note' => 'تبقى في هذه الحالة صفة التفخيم للطاء المدغمة ومن أجل ذلك يسمى إدغاماً ناقصاً.',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 3, // Reference to the "tajweed_categories" table
                'ruling_name' => 'إدغام المتقاربين',
                'ruling_description' => 'إذا تقارب الحرفان مخرجاً وصفة، وكان الأول منهما ساكناً، وجب إدغامه في الثاني - بلا غنة - وذلك في حالتين.',
                'ruling_letters' => 'اللام في الراء: مثل: قلْ رب تقرأ: " قُرَّب "
                    2.  القاف مع الكاف: مثل: المْ نخلقْكُم تقرأ: " نَخْلُكّمْ ". يجوز في هذه الحالة إبقاء صفة تفخيم القاف فيكون الإدغام ناقصاً أو حذف هذه الصفة ويكون الإدغام كاملاً.
                    "وتظهر جميع الأحرف الساكنة التي لم ترد لها أحكام خاصة عند بعضها البعض، وينبغي الانتباه إلى إظهار ما يلي: 
                    1.  الضاد الساكنة عند الطاء في نحو: ممن اضطر. 
                    2.  الضاد الساكنة عند التاء في نحو: فإذا أفضتم. 
                    3.  الظاء الساكنة عند التاء في نحو: سواءٌ علينا أوَعظت. 
                    4.  الدال الساكنة عند الكاف، نحو: لقدْ كدت."',
                'pronunciation_method' => '',
                'example' => 'نَخْلُكّمْ , ممن اضطر , سواءٌ علينا أوَعظت',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],

            // ============================= اللامات السواكن =====================================


            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => 'لام أل',
                'ruling_description' => 'وهي لام التعريف ، ولها قبل حروف الهجاء حالتان: حالة يجب فيها الإظهار، وحالة يجب فيها الإدغام. فيجب إظهارها إذا وقع بعدها حرف من الحروف الأربعة عشر المجموعة في: "ابغ حجك وخف عقيمه". . ويجب إدغامها إذا وقع بعدها حرف من الحروف الأربعة عشر الباقية من حروف الهجاء .',
                'ruling_letters' => '',
                'pronunciation_method' => 'فيجب إظهارها إذا وقع بعدها حرف من الحروف الأربعة عشر المجموعة في: "ابغ حجك وخف عقيمه". . ويجب إدغامها إذا وقع بعدها حرف من الحروف الأربعة عشر الباقية من حروف الهجاء',
                'example' => 'الإِنْسَانُ  الْبَارِئُ  الْغَنِيُّ  الْحَكِيمُ  الْجَمِيلَ  الْكَرِيمِ  الْوَلِيُّ الْخَبِيرُ  الْفَتَّاحُ  الْعُلَمَاءُ  الْقَيُّومُ  الْيَوْمَ  الْمُلْكُ  الْهُدَى . ... لطَّيِّبَاتُ  الثَّوَابِ  الصَّالِحِينَ  الرَّزَّاقُ  التَّائِبُونَ  الضَّالِّينَ  الذَّكَرُ  النَّعِيمِ  الدَّاعِ  السَّمِيعُ  الظَّالِمِينَ  الزَّبُورِ  الشَّكُورُ اللَّيْلِ ، ويسمى هذا النوع من الإدغام إدغاما شمسيا، وتسمى هذه اللام لاما شمسية. .',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => 'لام الفعل',
                'ruling_description' => 'اللام مثل: قُل لِعِبَادِيَ للتماثل , الراء مثل: وَقُل رَبِّ للتقارب',
                'ruling_letters' => 'اللام و الراء',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => 'لام الحرف',
                'ruling_description' => 'وهي في "هل" و "بل" وحكمها الإظهار .. إلا إذا وقع بعدها لام أو راء؛ فإنها تدغم فيهما كاللام في "قل"',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => 'كما يستثنى من قاعدة إدغام لام الحرف بَلْ رَانَ في المطففين آية 14؛ فإن حكمها الإظهار لحفص من طريق الشاطبية؛ لوجود السكت على اللام، والسكت مانع من الإدغام',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => ' لام الاسم',
                'ruling_description' => 'وحكمها الإظهار مطلقا',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' سُلْطَانٍ ، أَلْسِنَتُكُمُ ، عِلْمًا ، سَلْسَبِيلا ',
                'note' => 'وحكمها الإظهار مطلقا',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 6, // Reference to the "tajweed_categories" table
                'ruling_name' => 'لام الأمر',
                'ruling_description' => 'وهي من أدوات جزم المضارع وحكمها الإظهار مطلقا',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'وَلْيَكْتُب بَّيْنَكُمْ  وَلْيُوفُوا نُذُورَهُمْ ',
                'note' => 'وحكمها الإظهار مطلقا',
                'created_at' => now(),
                'updated_at' => now(),
                ],

        // =============================== madud ====================================


        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد الطبيعي أو الأصلي',
                'ruling_description' => 'هو ما لا تقوم ذات الحرف إلا به، ولا يتوقف على سبب همز بعده أو سكون.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' نوحيها. ومقدار مده حركتان، ولا يجوز الزيادة أو النقصان عن الحركتين. ',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد الفرعي',
                'ruling_description' => 'هو ما زاد على المد الأصلي، ويكون بسبب اجتماع حرف المد بهمز بعده أو سكون. فالهمز والسكون سببان للمد الفرعي، فعليه يكون 
                    المد الفرعي نوعان: مد بسبب الهمز، ومد بسبب السكون. ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد بسبب الهمز',
                'ruling_description' => 'إن كان الهمز قبل حرف المد فيسمى 
                        مد البدل: وسمي بدلاً لأن حرف المد فيه بُدل من الهمزة الساكنة.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' ءامنوا، أيماناً، أُوتوا.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد المتصل',
                'ruling_description' => 'هو أن يأتي حرف المد والهمز بعده في كلمة واحدة ويسمى المد الواجب المتصل. ويمد خمس حركات. 
                    المد الفرعي نوعان: مد بسبب الهمز، ومد بسبب السكون. ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' إذا جاء نصر الله والفتح ،  وأحاطت به خطيئته،  سُوءَ العذاب.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد المنفصل',
                'ruling_description' => 'هو أن يأتي حرف المد في آخر كلمة، والهمز بعده في كلمة أخرى تليها، ويسمى المد الجائز. ويمد خمس حركات، ونستطيع أن نقصره إلى حركتين.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' يا أيها ،  الذي أنزل ،  توبوآ إلى الله .',
                'note' => ' يمنع مد الألف في كلمة ( أنا ) حيثما وجد إلا في حالة الوقف، نحو: قال أنا أحي وأميت، وأنا أعلم.',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد بسبب سكون عارض',
                'ruling_description' => 'وهو أن يكون الحرف قبل الأخير من الكلمة حرف مد، والحرف الأخير متحرك، فإن درجنا الكلام ووصلنا الكلمة بما بعدها كان المد طبيعياً، وإن وقفنا على الحرف الأخير بالسكون صار المد الذي قبل الحرف الأخير مداً بسبب السكون العارض ويسمى:مداً عارضاً للسكون. يمد ست حركات، أو أربع، أو حركتان .',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' إن الله شديد العقاب}، قد أفلح المؤمنون، الحمد لله رب العالمين. ',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'المد بسبب سكون لازم',
                'ruling_description' => 'وهو أن يأتي بعد الحرف المد سكون لازم وصلاً ووقفاً في كلمة واحدة، ومقدار مده ست حركات.  وهو نوعان: الكلمي والحرفي.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => '(الكلمي) المد بسبب سكون لازم',
                'ruling_description' => 'وهو أن يأتي بعد حرف المد حرف ساكن في كلمة، فإن أدغم (أي كان الحرف الذي بعد المد مشدداً) فيسمى مثقلاً.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' آلذَّكرين، قل ءآللهُ أذِنَ لكم، ءآللهُ خيرٌ أمّا تشركون',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
        [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => '(الحرفي) المد بسبب سكون لازم',
                'ruling_description' => 'يوجد في فواتح بعض السور، في الحرف الذي هجاؤه ثلاث أحرف أوسطها حرف مد والثالث ساكن. وحروفه مجموعة في: بل كم قص وهو نوعان فإن أدغم سمي مثقلاً. وإن لم يدغم سمي مخففاً.  .',
                'ruling_letters' => 'وحروفه مجموعة في: بل كم قص وهو نوعان',
                'pronunciation_method' => ' فإن أدغم سمي مثقلاً. مثاله: آلم، المر، طسم  وإن لم يدغم سمي مخففاً مثاله: ن والقلم، ق والقرآن، المص',
                'example' => ' آلم، المر، طسم، ن والقلم، ق والقرآن، المص',
                'note' => 'حرف العين في فواتح السور يجوز أن يمد ست حركات، ويجوز أن يمد أربع حركات لأن الياء فيه ليست مدية بل هي حرف لين. ',
                'created_at' => now(),
                'updated_at' => now(),
                ],

                
           // ============================= لواحق المد =============================
           
           [
            'category_id' => 5, // Reference to the "tajweed_categories" table
            'ruling_name' => 'مد العوض',
            'ruling_description' => 'ويكون عند الوقف على التنوين المنصوب في آخر الكلمة، فيقرأ ألفاً عوضاً عن التنوين، ويمد مقدار حركتين، وإذا لم يوقف عليه فلا يمد. يشترط في هذا المد أن يكون الحرف المنوّن غير التاء المربوطة والألف المقصورة',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => 'أجراً عظيماً، عفواً غفوراً، إلا قليلاً.',
            'note' => 'يشترط في هذا المد أن يكون الحرف المنوّن غير التاء المربوطة والألف المقصورة.',
            'created_at' => now(),
            'updated_at' => now(),
            ],

            [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'مد التمكين',
                'ruling_description' => 'هو ياءان أولاهما مشددة مكسورة والثانية ساكنة، وسمي مد تمكين لأنه يخرج متمكناً بسبب الشدة، ويمد مقدار حركتين. .',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'حُييتم، النبيين.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'مد اللين',
                'ruling_description' => 'وهو مد حرفي المد: الياء والواو الساكنتان، المفتوح ما قبلها، والساكن ما بعدها سكوناً عارضاً في حالة الوقف. ويمد حركتين أو أربع، أو ست. .',
                'ruling_letters' => 'الياء والواو الساكنتان، المفتوح ما قبلها، والساكن ما بعدها سكوناً عارضاً في حالة الوقف',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'مد الصلة الكبرى',
                'ruling_description' => 'وهو مد هاء الضمير الغائب المفرد المذكر مضمومة أو مكسوره الواقعة بين متحركين (أي أن الحرف الذي قبلها من نفس الكلمة كان متحركاً والحرف الذي بعدها من الكلمة التي تليها كان متحركاً أيضاً) تشبع ضمه الهاء ليتولد عنها واو مدية أو تشبع كسرة الهاء ليتولد عنها ياء مدية، وتمد خمس حركات، ونستطيع أن نقصرها إلى حركتين كالمنفصل، وذلك إذا جاء بعدها همز. ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' وهو يحاوره أنا، وله أجر، به أحداً.',
                'note' => 'أقوى المدود: اللازم، فالمتصل، فالعارض للسكون، فالمنفصل، فالبدل.   إذا اجتمع سببان من أسباب المد قوى وضعيف، عمل بالقوى إذا وقع حرف المد في آخر الكلمة وأتى بعده حرف ساكن حذف حرف المد في الوصل نحو: وقالوا اتخذ، لصالوا الجحيم، حاضري المسجد الحرام.',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 5, // Reference to the "tajweed_categories" table
                'ruling_name' => 'مد الصلة الصغرى',
                'ruling_description' => 'وهو مد هاء الضمير الغائب المفرد المذكر… وتمد مقدار حركتين إن لم يأتي بعدها همز.. ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'أعّذبه عذاباً، قلته فقد علمته، بكلمته ويقطع. ويستثنى منه فلا يمد: يرضه لكم [الزمر: 7].',
                'note' => ' تقرأ: فيه مهانا [الفرقان: 69] ، بمد صلة على خلاف القياس مع أنها لم تقع بين متحركتين. ',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            

        // =============================== احكام الراء ===========================================
            [
                'category_id' => 7, // Reference to the "tajweed_categories" table
                'ruling_name' => 'تفخيم الراء',
                'ruling_description' => 'هو سِمَن يدخل على صوت الحرف حتى يمتلئ الفم بصداه. حروفه: (خُصّ ضَغْطٍ قِظْ) وتسمى أيضاً حروف الاستعلاء. ',
                'ruling_letters' => ' إذا كانت مفتوحة أو مضمومة , ذا كانت ساكنة وقبلها فتح أو ضم  , إذا كانت ساكنة وقبلها كسر عارض ,  ذا كانت ساكنة وقبلها كسر أصلي وبعدها حرف استعلاء غير مكسور في كلمة واحدة ',
                'pronunciation_method' => 'ينبغي الاحتراز عن التكرير في لفظ الراء . وكيفية الاحتراز عن التكرير بأن تلصق ظهر اللسان بأعلى الحنك لصقاً محكماً وتلفظ الراء مرة واحدة.',
                'example' => 'رَبّنا، رُزقنا. خردل، القّدْر، الأمُورْ. ارْجِعوا إلى أبيكم، أمْ أرْتابوا، لِمَنْ ارتضى. مِرْصادا، قِرْطاس، فِرْقة. ',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            
            [
                'category_id' => 7, // Reference to the "tajweed_categories" table
                'ruling_name' => 'ترقيق الراء',
                'ruling_description' => 'هو النطق بالحرف نحيفاً غير ممتلئ الفم بصداه. حروفه: كل حروف الهجاء ما عدا حروف الاستعلاء، وتسمى حروفه أيضاً حروف الاستفال.  ',
                'ruling_letters' => ' إذا كانت مكسورة , إذا كانت ساكنة وقبلها ياء ساكنة , إذا كانت ساكنة وقبلها كسر (ولا عبرة للسكون الفاصل) وليس بعدها حرف استعلاء غير مكسور',
                'pronunciation_method' => 'ينبغي الاحتراز عن التكرير في لفظ الراء . وكيفية الاحتراز عن التكرير بأن تلصق ظهر اللسان بأعلى الحنك لصقاً محكماً وتلفظ الراء مرة واحدة.',
                'example' => 'رِزقاً , خيْر، قديْر ,  أنِذرهم، فِرْعون، مِريْة، السِّحْر',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],

            [
                'category_id' => 7, // Reference to the "tajweed_categories" table
                'ruling_name' => 'جواز تفخيم او ترقيق الراء',
                'ruling_description' => ' إذا سكنت الراء في آخر الكلمة وكان الساكن الفاصل بينهما وبين الكسر حرف مفخّم ساكن او إذا كانت الراء ساكنة وقبلها كسر أصلي وبعدها حرف استعلاء مكسور ففيها الوجهان او  في حالة الوقف على هذه الكلمات: فأسْرِ، أن أسرِ حيثما وردت في القرآن. وكلمة يَسْر. وكلمة وَنُذْر ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'مِصْر، و قِطْر.  فِرْقٍ.  فأسْرِ، أن أسرِ حيثما وردت في القرآن. وكلمة يَسْر. وكلمة وَنُذْر ',
                'note' => 'حروف الاستعلاء من حيث قوة التفخيم على الترتيب التالي: الطاء ، فالضاد، فالصاد، فالظاء، فالقاف، فالغين، وفالخاء. وأقوى تفخيماً إذا كان حرف الاستعلاء مفتوحاً، بعده ألف نحو: طائفة ثم المفتوح وليس بعده ألف نحو: طَبَعَ، ثم المضموم نحو: طُوبَا، ثم المكسور نحو: طِبتُم.',
                'created_at' => now(),
                'updated_at' => now(),
                ],


                [
                    'category_id' => 7, // Reference to the "tajweed_categories" table
                    'ruling_name' => 'ترقيق الراء المكسورة اذا كانت موصولة',
                    'ruling_description' => 'ان تكون مكسورة كسرا اصليا مثل:رِجَالٌ، وَالْغَارِمِينَ ،  وَالْفَجْرِ  فالراء المكسورة ترقق مطلقا بدون قيد أو شرط. أو ان يكون كسرا عارضا مثل: وَأَنْذِرِ النَّاسَ فالراء المكسورة ترقق مطلقا بدون قيد أو شرط. ',
                    'ruling_letters' => '',
                    'pronunciation_method' => '',
                    'example' => 'رِجَالٌ، وَالْغَارِمِينَ ،  وَالْفَجْرِ  ,  وَأَنْذِرِ النَّاسَ',
                    'note' => '',
                    'created_at' => now(),
                    'updated_at' => now(),
                    ],
                [
                    'category_id' => 7, // Reference to the "tajweed_categories" table
                    'ruling_name' => 'ترقيق الراء الساكنة اذا كانت موصولة',
                    'ruling_description' => 'أن يكون قبل الراء كسرة أصلية متصلة بها ولم يقع بعدها حرف استعلاء مفتوح متصل  فإذا استوفت الراء الساكنة هذه الشروط مجتمعة وجب ترقيقها  مثل: فِرْعَوْنَ ، شِرْعَةً .',
                    'ruling_letters' => '',
                    'pronunciation_method' => '',
                    'example' => ' فِرْعَوْنَ ، شِرْعَةً .',
                    'note' => '',
                    'created_at' => now(),
                    'updated_at' => now(),
                    ],
                [
                    'category_id' => 7, // Reference to the "tajweed_categories" table
                    'ruling_name' => 'تفخيم الراء الساكنة اذا كانت موصولة',
                    'ruling_description' => 'إذا كانت مفتوحة مثل: رَبَّنَا إذا كانت مضمومة مثل: رُسُلٌ , أن سكنت بعد فتح مثل:  بَرْقٌ , أن سكنت بعد فتح مثل:  بَرْقٌ , أن سكنت بعد ضم مثل:  الْقُرْآنُ ,  أن سكنت بعد كسر إلا أنه عارض مثل:  ارْجِعِي , ي حالة الابتداء بهمزة الوصل، فقد عرض الكسر للابتداء بهمزة الوصل أو سكنت بعد كسر أصلي إلا أنه غير متصل بالراء  مثل: الَّذِي ارْتَضَى فكسرة الذال منفصلة عن الراء , اذا سكنت بعد كسر أصلي متصل بالراء إلا أن الراء وقع بعدها حرف استعلاء مفتوح متصل مثل: قِرْطَاسٍ،بسورةالأنعام فتفخم الراء الساكنة في كل ذلك لعدم استيفائها شروط الترقيق. إذا كان حرف الاستعلاء الواقع بعد الراء الساكنة مكسورا  في لفظ: فِرْقٍ بسورة الشعراء فقد اختلفوا في الراء حينئذ: فمنهم من فخمها نظرا لوجود حرف الاستعلاء، ومنهم من رققها نظرا لكسره. فالكسر قد أضعف تفخيمه، والترقيق أرجح من التفخيم.',
                    'ruling_letters' => '',
                    'pronunciation_method' => '',
                    'example' => 'فِرْعَوْنَ ، شِرْعَةً . رَبَّنَا , رُسُلٌ ,  بَرْقٌ,  الْقُرْآنُ , ارْجِعِي , الَّذِي ارْتَضَى ,  قِرْطَاسٍ , وَإِرْصَادًا،وفِرْقَةٍ , مِرْصَادًا بالنبأ , لَبِا لْمِرْصَادِ  بسورة والفجر , فِرْقٍ بسورة الشعراء',
                    'note' => 'إذا كان حرف الاستعلاء الواقع بعد الراء الساكنة منفصلا عن الراء بأن وقع في كلمة أخرى',
                    'created_at' => now(),
                    'updated_at' => now(),
                    ],


                    [
                        'category_id' => 7, // Reference to the "tajweed_categories" table
                        'ruling_name' => 'ترقيق الراء في حالة الوقف عليها',
                        'ruling_description' => 'الأولى: أن يقع قبلها كسر مباشر الثانية: أن يقع قبلها كسر غير مباشر بأن فصل بينه وبين الراء حرف ساكن مستفل الثالثة:أن يقع قبلها ياء ساكنةحكم الراء إذا وقف عليها بالسكون المجرد، كذلك إذا وقف عليها بالإشمام حكم الراء إذا وقف عليها بالروم فحكمها كالوصل إذا وقفت بالسكون المجرد أو مع الإشمام رققت الراء؛ لوقوعها بعد ياء ساكنة. أما إذا وقفت بالروم فخمت الراء؛ لأنها مضمومة، وقد علمت أن الراء المضمومة تفخم في حالة الوصل، فكذلك تفخم في حالة الوقف عليها بالروم؛ لأنه كالوصل ',
                        'ruling_letters' => '',
                        'pronunciation_method' => '',
                        'example' => ' بَصَائِرُ ,  سِحْرٌ ، الذِّكْرَ  , قَدِيرٌ ،الْخَيْرُ , الْقَمَرَ  ، النُّذُرُ  ،  وَالْفَجْرِ  , ',
                        'note' => '',
                        'created_at' => now(),
                        'updated_at' => now(),
                        ],
                    [
                        'category_id' => 7, // Reference to the "tajweed_categories" table
                        'ruling_name' => 'كلمات اختلف فيها',
                        'ruling_description' => 'إذا وقفت على راء  مِصْرَ ، أو راء الْقِطْرِ بسبأ، ففي الراء وجهان: الترقيق والتفخيم. فمن رقق نظر إلى الكسر، ولم يعتبر الساكن الفاصل بين الكسر والراء.ومن فخم اعتبر هذا الساكن، وعده حاجزا حصينا بين الكسرة والراء؛ لكونه حرف استعلاء. والأرجح في "مصر" التفخيم، وفي "القطر" الترقيق؛ نظرا للوصل، وعملا بالأصل.  وفي كلمة: يَسْرِ ، بالفجر، وكذا: أَسْرِ حيث وقع، وَنُذُرِ  بالقمر وجهان وقفا كذلك. والأرجح الترقيق للفرق بين كسرة الإعراب وكسرة البناء، وللدلالة على الياء المحذوفة.  ',
                        'ruling_letters' => '',
                        'pronunciation_method' => '',
                        'example' => ' بَصَائِرُ ,  سِحْرٌ ، الذِّكْرَ  , قَدِيرٌ ،الْخَيْرُ , الْقَمَرَ  ، النُّذُرُ  ،  وَالْفَجْرِ  , ',
                        'note' => '',
                        'created_at' => now(),
                        'updated_at' => now(),
                        ],

            // احكام متفرفة =================================================


            [
                'category_id' => 8, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الروم',
                'ruling_description' => 'هو إضعاف الصوت بالحركة ( الضمة أو الكسرة) حتى يذهب معظم صوتها، فيسمع لها صوت خفي يسمعه القريب المصغي دون البعيد، لأنها غير تامة.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 8, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الاشمام',
                'ruling_description' => 'هو ضم الشفتين بُعَيْدَ الإسكان إشارة إلى الضم مع بعض انفراج بينهما ليخرج منه النفس، ولا يدرك لغير البصير. لأنه يسمع ولا يرى.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'وتشم النون في قوله تعالى: يَا أَبَانَا مَا لَكَ لا تَأْمَنَّا عَلَى يُوسُفَ [يوسف: 11] إشعارا بحذف حركة النون الأولى: تأمننا.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 8, // Reference to the "tajweed_categories" table
                'ruling_name' => 'السكتات',
                'ruling_description' => 'السكت هو قطع الصوت عند القراءة بدون تنفس بمقدار حركتين، ويجب السكت في أربعة مواضع على قراءة حفص.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' وَلَمْ يَجْعَلْ لَهُ عِوَجَا * قَيِّمًا لِيُنذِرَ بَأْسًا…الآية [الكهف: 1-2] ..  قَالُوا يَا وَيْلَنَا مَنْ بَعَثَنَا مِنْ مَرْقَدِنَا هَذَا مَا وَعَدَ الرَّحْمَانُ [يس: 52] ..  وَقِيلَ مَنْ رَاقٍ [القيامة :27] ..  كَلا بَلْ رَانَ عَلَى قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ [المطففين: 14] ..  وجاز في  ما أغنى عني ماليه * هلك  الوجهان السكت والإدغام.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],

                //  ================= باب الوقف،   : ===================
            [
                'category_id' => 9, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الوقف',
                'ruling_description' => ' عبارة عن قطع الصوت على الكلمة زمنا يتنفس فيه عادة بنية استئناف القراءة، فلا بد من التنفس معه ويأتي في رءوس الآيات، وأوساطها، ولا يأتي في وسط الكلمة، ولا فيما اتصل رسما، فلا يوقف على: "لكي" في قوله تعالى:  لِكَيْلا يَعْلَمَ مِنْ بَعْدِ عِلْمٍ شَيْئًا  بالحج؛ لاتصاله رسما.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' وَلَمْ يَجْعَلْ لَهُ عِوَجَا * قَيِّمًا لِيُنذِرَ بَأْسًا…الآية [الكهف: 1-2] ..  قَالُوا يَا وَيْلَنَا مَنْ بَعَثَنَا مِنْ مَرْقَدِنَا هَذَا مَا وَعَدَ الرَّحْمَانُ [يس: 52] ..  وَقِيلَ مَنْ رَاقٍ [القيامة :27] ..  كَلا بَلْ رَانَ عَلَى قُلُوبِهِمْ مَا كَانُوا يَكْسِبُونَ [المطففين: 14] .. .',
                'note' => 'أقسام الوقف: ينقسم الوقف إلى أربعة أقسام: اختياري , اضطراري , انتظاري , اختباري',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 9, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الوقف الاختياري',
                'ruling_description' => ' وهو أن يقصد لذاته من غير عروض سبب من الأسباب. ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => 'أقسام الوقف الاختياري: ينقسم الوقف الاختياري إلى أربعة أقسام: التام , الكافي , الحسن , القبيح',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 9, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الوقف الاختياري التام',
                'ruling_description' => 'هو الوقف على كلمة لم يتعلق ما بعدها بها، ولا بما قبلها لا لفظا ولا معنى، ويقصد بالتعلق اللفظي التعلق من جهة الإعراب. وأكثر ما يوجد هذا النوع في رءوس الآي، وعند انقضاء القصص',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'كالوقف على "المفلحون" من قوله تعالى:  أُولَئِكَ عَلَى هُدًى مِنْ رَبِّهِمْ وَأُولَئِكَ هُمُ الْمُفْلِحُونَ  والابتداء بقوله:  إِنَّ الَّذِينَ كَفَرُوا  فإن الأولى من تمام أحوال المؤمنين، والثانية متعلقة بأحوال الكافرين.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 9, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الوقف الاختياري الكافي',
                'ruling_description' => 'هو الوقف على كلمة لم يتعلق ما بعدها بها، ولا بما قبلها لفظا، بل معنى فقط',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'كالوقف على: لا يُؤْمِنُونَ  والابتداء بقوله تعالى: خَتَمَ اللَّهُ عَلَى قُلُوبِهِمْ فإن قوله: "لا يؤمنون" مع ما بعده متعلق بالكافرين من جهة المعنى.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 9, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الوقف الاختياري الحسن ',
                'ruling_description' => 'هو الوقف على كلمة تعلق ما بعدها بها، أو بما قبلها لفظا ومعنى، بشرط إفادته معنى يحسن السكوت عليه، ومن ثم سمي حسنا',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'كالوقف على لفظ "لله" من قوله الله تعالى: الْحَمْدُ لِلَّهِ فهذه الجملة أفادت معنى، لكن ما بعد لفظ الجلالة متعلق به لكونه صفة له.',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 9, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الوقف الاختياري القبيح ',
                'ruling_description' => 'هو الوقف على لفظ غير مفيد، وقد تعلق ما بعده بما قبله لفظا ومعنى، كالوقف على المبتدأ دون خبره، أو على المضاف دون المضاف إليه.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => ' فالوقف على: "الحمد" من قوله تعالى: الْحَمْدُ لِلَّهِ قبيح، وكذلك الوقف على: "بسم" من: بِسْمِ اللَّهِ / وأشد قبحا الوقف والابتداء الموهمان خلاف المراد: كالوقف على قوله تعالى: إِنَّ اللَّهَ لا يَسْتَحْيِي ، وكالوقف على قوله: لَقَدْ سَمِعَ اللَّهُ قَوْلَ الَّذِينَ قَالُوا ، ثم الابتداء بقوله: إِنَّ اللَّهَ فَقِيرٌ ، وغير ذلك مما يوهم الوقف عليه أو الابتداء وصفا لا يليق به تعالى، أو يفهم معنى غير ما أراده الله جل وعلا فمن وقف على مثل هذا لضرورة وجب عليه أن يرجع إلى ما قبله، ويصل الكلام بعضه ببعض.',
                'note' => 'فكل وقف على ما لا يفهم منه معنى يعد قبيحا، ولا يجوز إلا لضرورة، كانقطاع نفس ونحوه، أو لتعليم القارئ الوقف على الكلمة. ولا بد من الابتداء بالكلمة الموقوف عليها، أو بما قبلها على حسب ما يقتضيه المعنى من الحسن؛ لأن الوقف قد أبيح للضرورة، ولا ضرورة في الابتداء، فلا يكون إلا اختياريا، ومن ثم فلا يجوز إلا بمستقل بالمعنى موفٍ بالمقصود، فالابتداء بما تعلق بما قبله يعتبر قبيحا.',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 9, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الوقف الاضطراري ',
                'ruling_description' => ' وهو ما يعرض بسبب ضيق النفس، ونحوه كعجز ونسيان. فحينئذ يجوز الوقف على أية كلمة، وإن لم يتم المعنى، لكن يجب الابتداء بالكلمة الموقوف عليها إن صلح الابتداء بها، أو بما قبلها إن لم يصلح.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            
            [
                'category_id' => 9, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الوقف الانتظاري ',
                'ruling_description' => 'وهو أن يقف القارئ على كلمة ليعطف عليها غيرها حين جمعه للقراءات.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],
            [
                'category_id' => 9, // Reference to the "tajweed_categories" table
                'ruling_name' => 'الوقف الاختباري ',
                'ruling_description' => 'وهو ما كان الغرض منه اختبار الشخص وامتحانه، ويتعلق بالرسم كالمقطوع، والموصول، والثابت، والمحذوف، ولا يوقف عليه إلا إجابة لسؤال ممتحن، أو لتعليم القارئ كيف يقف إذا اضطر للوقف.',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],

        // ================ باب السكت ==========================
            
        [
            'category_id' => 10, // Reference to the "tajweed_categories" table
            'ruling_name' => 'السكت',
            'ruling_description' => 'هو قطع الصوت زمنا يسيرا من غير تنفس، ويأتي في وسط الكلمة، وفي آخرها.',
            'ruling_letters' => '',
            'pronunciation_method' => 'مواضع السكت: ورد السكت عن حفص في أربعة مواضع:  الأول: قوله تعالى: وَلَمْ يَجْعَلْ لَهُ عِوَجًا  بالكهف، فالسكت هنا على الألف المبدلة من التنوين في لفظ "عوجا" وذلك لبيان أن ما بعده وهو قول تعالى:  قَيِّمًا ليس متصلا بما قبله.  الثاني: قوله تعالى: قَالُوا يَا وَيْلَنَا مَنْ بَعَثَنَا مِنْ مَرْقَدِنَا في يس، فالسكت هنا على ألف "مرقدنا"؛ وذلك لبيان أن كلام الكفار قد انقضى، وما بعده وهو قوله: هَذَا مَا وَعَدَ الرَّحْمَنُ وَصَدَقَ الْمُرْسَلُونَ  ليس من كلامهم، بل هو من كلام الملائكة، أو المؤمنين. الثالث: قوله تعالى:  وَقِيلَ مَنْ رَاقٍ  فالسكت هنا على نون "من"؛ لئلا يتوهم أنها مع ما بعدها كلمة واحدة على وزن "فعال".  الرابع: قوله تعالى: بَلْ رَانَ  بالمطففين، فالسكت هنا على لام "بل" لما تقدم في مَنْ رَاقٍ .',
            'example' => 'وَلَمْ يَجْعَلْ لَهُ عِوَجًا /  قَالُوا يَا وَيْلَنَا مَنْ بَعَثَنَا مِنْ مَرْقَدِنَا /  وَقِيلَ مَنْ رَاقٍ / بَلْ رَانَ ',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],


        // ================ باب القطع ==========================
            
        [
            'category_id' => 11, // Reference to the "tajweed_categories" table
            'ruling_name' => 'القطع',
            'ruling_description' => 'عبارة عن قطع القراءة رأسا، ولا يكون إلا على رءوس الآي؛ لأن رءوس الآي في نفسها مقاطع. ',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],

        // =================== باب الابتداء ================

        [
            'category_id' => 12, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الابتداء بهمزة الوصل',
            'ruling_description' => 'هي الهمزة الزائدة في أول الكلمة، الثابتة في الابتداء الساقطة في الدرج –أي في الوصل- من المقرر أن للقارئ حالات/ حالة ابتداء وحالة وصل وحالة وقف، ومن الأصول المقرر ألا يبتدأ بساكن وألا يوقف على متحرك، وعلى هذا فإن من الكلمات ما يكون أولها متحركا وهذا لا إشكال فيه عند الابتداء إذ الابتداء بالحركة غير متعذر، ومنها ما يكون أولها ساكناً والابتداء بالساكن غير مقدور عليه ومن ثم احتيج إلى اجتلاب همزة زائدة في أول هذه الكلمة هي همزة الوصل، ليتوصل بها إلى النطق بالساكن الموجود في أول هذه الكلمة.',
            'ruling_letters' => '',
            'pronunciation_method' => 'نحو قوله تعالى: (قل الحمد لله وسلام على عباده الذين اصطفا) (النمل: 59) فالهمزة في كلمة (الحمد) و (الذين) و (اصطفا) هي همزة وصل لسقوطها في الوصل أي حال وصل هذه الكلمات بما قبلها وثبوتها في الابتداء إذا ابتدئ بها.',
            'example' => ' (قل الحمد لله وسلام على عباده الذين اصطفا) (النمل: 59)',
            'note' => 'وسميت بهمزة الوصل لأنها يتوصل بها إلى النطق بالساكن كما مر ولذا سماها الخليل بن أحمد: سلم اللسان.وأما مواضعها فتأتي في الأسماء والأفعال والحروف، وتارة تكون قاسية وهو الأكثر وروداً، وتارة تكون سماعية وهو الأقل',
            'created_at' => now(),
            'updated_at' => now(),
            ],

        [
            'category_id' => 12, // Reference to the "tajweed_categories" table
            'ruling_name' => 'همزة الوصل في الأسماء قياسية',
            'ruling_description' => 'أما القياسية فتحرك بالكسر وذلك في مصدر الفعل الخماسي',
            'ruling_letters' => '',
            'pronunciation_method' => ' نحو (افترآء) (اختلاف) في قوله تعالى (وحرموا ما رزقهم الله افترآءً على الله) (الأنعام: 140) وقوله تعالى (إن في اختلاف اليل والنهار) يونس/6 . وفي مصدر الفعل السداسي : نحو: (استغفار) (استعجالهم) (استكباراً) في قوله تعالى: (وما كان استغفار إبراهيم لأبيه إلا عن موعدةٍ وعدهآ أياه) (التوبة/114 وقوله تعالى (ولو يعجل الله للناس الشر استعجالهم بالخير لقضي إليهم أجلهم) يونس/11 وقوله تعالى: (وأصروا واستكبروا استكبارا) (نوح: 7).',
            'example' => 'نحو (افترآء) (اختلاف) في قوله تعالى (وحرموا ما رزقهم الله افترآءً على الله) (الأنعام: 140) وقوله تعالى (إن في اختلاف اليل والنهار) يونس/6 . وفي مصدر الفعل السداسي : نحو: (استغفار) (استعجالهم) (استكباراً) في قوله تعالى: (وما كان استغفار إبراهيم لأبيه إلا عن موعدةٍ وعدهآ أياه) (التوبة/114 وقوله تعالى (ولو يعجل الله للناس الشر استعجالهم بالخير لقضي إليهم أجلهم) يونس/11 وقوله تعالى: (وأصروا واستكبروا استكبارا) (نوح: 7)',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
        [
            'category_id' => 12, // Reference to the "tajweed_categories" table
            'ruling_name' => 'همزة الوصل في الأسماء سماعية',
            'ruling_description' => 'في أسماء محفوظة ورد منها في القران سبعة أسماء وتكون الهمزة فيها مكسورة',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => 'وهي (ابن)، (ابنة)، (امرؤ)، (امرأة)، (اثنين)، (اسم) ، نحوك (إن ابني من أهلي) (هود: 45)، (ومريم ابنت عمران) (التحريم:12) (كل امرئ بما كسب رهين) (الطور:21) (وضرب الله مثلا للذين ءامنوا امرأت فرعون) (التحريم:11) (ثاني اثنين) (التوبة: 40) (وقطعناهم اثنتي عشرة أسباطا أمما) (الأعراف:160) (سبح اسم ربك الأعلى).',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
        [
            'category_id' => 12, // Reference to the "tajweed_categories" table
            'ruling_name' => 'همزة الوصل في الحروف وحركة البدء بها',
            'ruling_description' => 'لم ترد همزة الوصل في الحروف إلا في لام التعريف، وهمزة الوصل فيها قياسية وحركتها عند الابتداء الفتحة طلباً للخفة ولكثرة دورانها',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => 'نحو قوله تعالى: (هو الله الخالق البارئ المصور له الأسماء الحسنى يسبح له ما في السمأوات والأرض وهو العزيز الحكيم). (الحشر:24)',
            'note' => 'تنبيه: إذا وقف القارئ على (بئس) – لضرورة أو اختبار أو نحو ذلك – وأراد الابتداء اختباراً بـ(الاسم) من قوله تعالى (بئس الاسم الفسوق بعد الأيمان) (الحجرات: 11) فيجوز الابتداء بإثبات الهمزة مفتوحة: (ألسم) وهو الأولى، أو الابتداء باللام المكسورة مع ترك همزة الوصل: (لِسم) وسبب كسر اللام: التخلص من ثقل اجتماع الساكنين وهما اللام والسين.أما في حالة وصل (بئس) بـ(الاسم) فليس فيه إلا وجه واحد وهو إسقاط همزة الوصل وكسر اللام .',
            'created_at' => now(),
            'updated_at' => now(),
            ],
        [
            'category_id' => 12, // Reference to the "tajweed_categories" table
            'ruling_name' => 'همزة الوصل في الأفعال وحركة البدء بها',
            'ruling_description' => 'همزة الوصل في الأفعال قياسية، ولا توجد إلا في الفعل الماضي الخماسي والسداسي وفي فعل الأمر الذي ماضيه ثلاثي أو خماسي أو سداسي أما حركة همزة الوصل عند البدء بالأفعال –فيما فيه همزة وصل- فتكون إما بالكسر وإما بالضم. وشرط البدء بالكسر أن يكون ثالث الفعل مفتوحاً أو مكسوراً أمثلة ذلك: (انقلب)، (ارتضى)، (اذهبوا)، (اهدنا)، (اصبر)، (اصرف). وأما حركة البدء بالضم فشرطها   أن يكون ثالث الفعل مضموما ضماً لازماً  (ادعُ)، (اتلُ)، (اخرُجُوا) أو أن يكون فعلاً خماسياً أو سداسياً مبنياً للمجهول  مثل: (استحفظوا)، (اجتثت)، (ابتلىَ).  أما إذا كان الفعل مضموماً ضماً عارضاً فيُبدأ فيه بكسر همزة الوصل وذلك في: (اقضوا)، (ابنوا)ن (امشوا)، (ائتوا)  فأصل حركة الثالث في هذه الأفعال هو الكسر، والضم عارض لمناسبة الوأو التي اتصلت بها .',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => ' أمثلة ذلك على التوالي: (اقترب)، (استغفر)، (اضرب)، (انطلقوا)، (استغفر) .  (انقلب)، (ارتضى)، (اذهبوا)، (اهدنا)، (اصبر)، (اصرف).  (ادعُ)، (اتلُ)، (اخرُجُوا) .  (استحفظوا)، (اجتثت)، (ابتلىَ)   (اقضوا)، (ابنوا)ن (امشوا)، (ائتوا) ',
            'note' => 'تنبيه: إذا وقف القارئ على (بئس) – لضرورة أو اختبار أو نحو ذلك – وأراد الابتداء اختباراً بـ(الاسم) من قوله تعالى (بئس الاسم الفسوق بعد الأيمان) (الحجرات: 11) فيجوز الابتداء بإثبات الهمزة مفتوحة: (ألسم) وهو الأولى، أو الابتداء باللام المكسورة مع ترك همزة الوصل: (لِسم) وسبب كسر اللام: التخلص من ثقل اجتماع الساكنين وهما اللام والسين.أما في حالة وصل (بئس) بـ(الاسم) فليس فيه إلا وجه واحد وهو إسقاط همزة الوصل وكسر اللام .',
            'created_at' => now(),
            'updated_at' => now(),
            ],
        [
            'category_id' => 12, // Reference to the "tajweed_categories" table
            'ruling_name' => 'اجتماع همزتي القطع والوصل معاً في كلمة واحدة',
            'ruling_description' => 'له صورتان: الصورة الأولى: تقدم همزة الوصل على همزة القطع الساكنة. الصورة الثانية: تقدم همزة القطع التي للاستفهام على همزة الوصل: وقد وقع ذلك في الأفعال وفي الأسماء.',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => ' أمثلة ذلك على التوالي: (اقترب)، (استغفر)، (اضرب)، (انطلقوا)، (استغفر) .  (انقلب)، (ارتضى)، (اذهبوا)، (اهدنا)، (اصبر)، (اصرف).  (ادعُ)، (اتلُ)، (اخرُجُوا) .  (استحفظوا)، (اجتثت)، ( ابتلىَ)   (اقضوا)، (ابنوا)ن (امشوا)، (ائتوا) ',
            'note' => 'تنبيه: إذا وقف القارئ على (بئس) – لضرورة أو اختبار أو نحو ذلك – وأراد الابتداء اختباراً بـ(الاسم) من قوله تعالى (بئس الاسم الفسوق بعد الأيمان) (الحجرات: 11) فيجوز الابتداء بإثبات الهمزة مفتوحة: (ألسم) وهو الأولى، أو الابتداء باللام المكسورة مع ترك همزة الوصل: (لِسم) وسبب كسر اللام: التخلص من ثقل اجتماع الساكنين وهما اللام والسين.أما في حالة وصل (بئس) بـ(الاسم) فليس فيه إلا وجه واحد وهو إسقاط همزة الوصل وكسر اللام .',
            'created_at' => now(),
            'updated_at' => now(),
            ],
        [
            'category_id' => 12, // Reference to the "tajweed_categories" table
            'ruling_name' => ' تقدم همزة الوصل على همزة القطع الساكنة',
            'ruling_description' => 'وذلك لا يكون إلا في الأفعال خاصة  نحو: (اؤتمن)، (ائذن)، (ائتنا)، (ائتوني)  فإذا ابتُدئ بالكلمة التي فيها هذه الهمزة فحينئذٍ تُثبت همزة الوصل وتُبدل همزة القطع وتكون حرجة همزة الوصل في هذه الحالة، حسب حركة ثالث الفعل كما مر سابقاً.',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => '(أوتمن)، (أيذن)، (أيتنا)، (أيتوني)',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
        [
            'category_id' => 12, // Reference to the "tajweed_categories" table
            'ruling_name' => ' تقدم همزة القطع التي للاستفهام على همزة الوصل في الافعال',
            'ruling_description' => 'تحذف همزة الوصل وتبقى همزة الاستفهام مفتوحة، وقد ورد في القرآن الكريم عدة أفعال',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => '  
            (أطلع الغيب أم اتخذ عند الرحمن عهداً) مريم:78
            (افترى على الله كذباً أم به جنة) سبأ:8
            (أصطفى البنات على البنين) الصافات:153
            (أتخذناهم سخرياً أم زاغت الأبصار) ص:63
            (أستكبرت أم كنت من العالين) ص:75
            (أستغفرت لهم أم لم تستغفر لهم) المنافقون:6
            (قل أتخذتم عند الله عهداً) البقرة:80 ',
            'note' => 'ووجه حذف همزة الوصل في هذه الأفعال أنها بعد دخول همزة الاستفهام عليها أصبحت: (أإتخذتم، أإطلع، أإفترى، أإستكبرت، أإستغفرت، أإتخذناهم، أإصطفى) بهمزتين : الأولى همزة استفهام ولا تكون إلا مفتوحة. والثانية: همزة الوصل وهي مكسورة ابتداءً لوجودها في الماضي الخماسي في (اتخذتم، اطلع، افترى، اتخذناهم، اصطفى) وفي الماضي السداسي في (استكبرت، استغفرت) فحذفت الثانية استغناء عنها بهمزة الاستفهام ولا يترتب على حذفها التباس الاستفهام بالخبر لأن همزة الاستفهام إحدى همزات القطع المفتوحة أبداً وهي ثابتة في الوصل والابتداء، بخلاف همزة الوصل فإنها ثابتة في الابتداء ساقطة في الوصل، وهي في هذه الأفعال مكسورة في الابتداء لفتح ثالث هذه الأفعال.',
            'created_at' => now(),
            'updated_at' => now(),
            ],

            [
                'category_id' => 12, // Reference to the "tajweed_categories" table
                'ruling_name' => 'تقدم همزة القطع التي للاستفهام على همزة الوصل في الاسماء',
                'ruling_description' => 'تبقى الهمزتان المجتمعتان معاً في الكلمة، وشرطه أن تكون همزة الوصل مفتوحة في البدء وواقعة في اسم مبدوء بال، وحينئذٍ لا يجوز حذفها بالإجماع، لئلا يلتبس الاستفهام بالخبر فيتغير المعنى تبعاً لذلك، والوارد من هذه الصور في القران ثلاث كلمات في ستة مواضع:  أولها وثانيها: (ءآلذكرين) في قوله تعالى: (قل ءآلذكرين حرم أم الانثيين) الأنعام: 134-144  .. وثالثها ورابعها: (ءآلئان) في قوله تعالى: (ءآلئان وقد كنتم به تستعجلون) يونس: 51، وقوله (ءآلئان وقد عصيت قبل) يونس: 91. .. وخامسها وسادسها: (ءآلله) في قوله تعالى: (ءآلله أذن لكم) يونس:59، وقوله (ءآلله خير أما يشركون) (النمل:59). ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => '(ءآلذكرين) في قوله تعالى: (قل ءآلذكرين حرم أم الانثيين) 
                (ءآلئان) في قوله تعالى: (ءآلئان وقد كنتم به تستعجلون) يونس: 51، وقوله (ءآلئان وقد عصيت قبل) يونس: 91
                (ءآلله) في قوله تعالى: (ءآلله أذن لكم) يونس:59، وقوله (ءآلله خير أما يشركون) (النمل:59).',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],


        // ====================== حروف الاستعلاء =====================

        
        [
            'category_id' => 13, // Reference to the "tajweed_categories" table
            'ruling_name' => 'حروف الاستعلاء',
            'ruling_description' => 'أما حروف الاستعلاء: وقد تقدم في باب صفات الحروف أنها سبعة، مجموعة في قولهم: "خص ضغط قظ" وهي: الخاء، والصاد، والضاد، والغين، والطاء، والقاف، والظاء. وتختص حروف الإطباق الأربعة بتفخيم أقوى: وهي الصاد، والضاد، والطاء، والظاء. فحكمها التفخيم بلا استثناء',
            'ruling_letters' => 'الخاء، والصاد، والضاد، والغين، والطاء، والقاف، والظاء.',
            'pronunciation_method' => '',
            'example' => '(أوتمن)، (أيذن)، (أيتنا)، (أيتوني)',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],


      // ============================= ألتفخيم والترقيق =====================================
      
      [
        'category_id' => 4, // Reference to the "tajweed_categories" table
        'ruling_name' => 'التفخيم',
        'ruling_description' => 'لغة: التسمين. واصطلاحا: عبارة عن سمن يدخل على جسم الحرف -أي صوته- فيمتلئ الفم بصداه. والتفخيم، والتسمين، والتغليظ بمعنى واحد، لكن المستعمل في اللام التغليظ، وفي الراء التفخيم. ',
        'ruling_letters' => 'الحروف تفخيماً وترقيقاً: الحروف قسمان: حروف استعلاء، وحروف استفال.',
        'pronunciation_method' => '',
        'example' => '',
        'note' => '',
        'created_at' => now(),
        'updated_at' => now(),
        ],
      [
        'category_id' => 4, // Reference to the "tajweed_categories" table
        'ruling_name' => 'مراتب التفخيم',
        'ruling_description' => 'أعلاها في المفتوح الذي بعده ألف مثل: طَائِعِينَ , المفتوح الذي ليس بعده ألف مثل: طَلَبًا , المضموم  مثل: يَسْطُرُونَ ,  الساكن مثل: أَطْعَمَهُمْ ,  المكسور مثل: طِبْتُمْ',
        'ruling_letters' => 'الحروف تفخيماً وترقيقاً: الحروف قسمان: حروف استعلاء، وحروف استفال.',
        'pronunciation_method' => '',
        'example' => ' طَائِعِينَ ,طَلَبًا ,يَسْطُرُونَ , أَطْعَمَهُمْ , طِبْتُمْ  ',
        'note' => '',
        'created_at' => now(),
        'updated_at' => now(),
        ],
      [
        'category_id' => 4, // Reference to the "tajweed_categories" table
        'ruling_name' => 'تفخيم وترقيق اللام',
        'ruling_description' => 'تفخم اللام في لفظ الجلالة الواقع بعد فتح نحو: تَاللَّهِ  , تفخم اللام في لفظ الجلالة الواقع بعد أو ضم  مثل: نَصْرُ اللَّهِ , وترقق إذا وقع لفظ الجلالة بعد كسر  مثل: بِاللَّهِ و بِسْمِ اللَّهِ',
        'ruling_letters' => '',
        'pronunciation_method' => '',
        'example' => 'بِسْمِ اللَّهِ , تَاللَّهِ , نَصْرُ اللَّهِ , بِاللَّهِ',
        'note' => '',
        'created_at' => now(),
        'updated_at' => now(),
        ],
      [
        'category_id' => 14, // Reference to the "tajweed_categories" table
        'ruling_name' => 'حروف الاستفال',
        'ruling_description' => ' جميع الحروف عدا حروف الاستعلاء أ، ب، ت، ث، ج، ح، خ، د، ذ، ر، ز، س، ش ، ع ، ف ، ك، ل  م، ن، هـ، و، ي .حكمها الترقيق إلا اللام والراء في بعض أحوالهما، وإلا الألف.',
        'ruling_letters' => 'أ، ب، ت، ث، ج، ح، خ، د، ذ، ر، ز، س، ش ، ع ، ف ، ك، ل  م، ن، هـ، و، ي',
        'pronunciation_method' => '',
        'example' => '',
        'note' => '',
        'created_at' => now(),
        'updated_at' => now(),
        ],
      [
        'category_id' => 14, // Reference to the "tajweed_categories" table
        'ruling_name' => 'حكم الألف والغنة',
        'ruling_description' => 'حكمها أنها تابعة لما قبلها تفخيما وترقيقاإذا كان الحرف الذي قبلها مفخما فخمت إذا كان الحرف الذي قبلها مرققا رققت الغنة بعكس الألف، فهي تابعة لما بعدها تفخيما وترقيقا إذا كان الحرف الذي بعدها مفخما فخمت إذا كان الحرف الذي بعدها مرققا رققت',
        'ruling_letters' => '',
        'pronunciation_method' => '',
        'example' => 'قَالَ و طَالَ ,  نَاعِمَةٌ عَالِيَةٍ ,يَنْصُرُكُمُ فتفخم الغنة؛ لأن الصاد مفخمة. ,   أَنْزَلْنَاهُ فترقق الغنة لترقيق الزاي. ',
        'note' => '',
        'created_at' => now(),
        'updated_at' => now(),
        ],


        // ====================== الوقف على أواخر الكلم =============================

        [
            'category_id' => 15, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الإسكان المحض',
            'ruling_description' => 'لأن العرب لا يبتدئون بساكن، ولا يقفون على متحرك بالحركة، وإنما كان السكون أصلا في الوقف؛ لأنه لما كان الغرض من الوقف الاستراحة، والسكون أخف من الحركات كلها، وأبلغ في تحصيل الراحة، صار أصلا بهذا الاعتبار.',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
        [
            'category_id' => 15, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الروم',
            'ruling_description' => 'وهو الإتيان ببعض الحركة حتى يذهب معظم صوتها، فيسمع لها صوت خفي، يسمعه القريب المصغي دون البعيد؛ لأنها غير تامة. فيمتنع معه الإدغام الصحيح؛ لأن الحركة لا تسكن رأسا، بل يضعف صوتها، وبعضهم يعبر عن الروم بالإخفاء.',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
        [
            'category_id' => 15, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الاشمام',
            'ruling_description' => ' وهو ضم الشفتين بعيد سكون الحرف كهيئتهما عند النطق بالضمة، وهو إشارة إلى الضم، ومن ثَم فلا يدركه إلا البصير. وفائدة الروم والإشمام: بيان الحركة الأصلية التي ثبتت في الوصل للحرف الموقوف عليه.  هناك أنواع أخرى للإشمام غير إشمام الوقف لا حاجة لذكرها، ولكنا نذكر منها نوعا ورد في لفظ "تأمنا" في قوله تعالى: مَا لَكَ لا تَأْمَنَّا عَلَى يُوسُفَ ، فأصل الكلمة "تأمننا" بنونين، أدغمت الأولى في الثانية للجميع. ',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
        [
            'category_id' => 15, // Reference to the "tajweed_categories" table
            'ruling_name' => 'ما يجوز فيه الروم والإشمام، وما لا يجوز',
            'ruling_description' => ' ما يوقف عليه بالأنواع الثلاثة المتقدمة، وهي: السكون، والروم، والإشمام، وهو ما كان متحركا بالرفع أو الضم  مثل نَسْتَعِينُ ، مِنْ قَبْلُ وَمِنْ بَعْدُ . ما يوقف عليه بالسكون والروم فقط ولا يجوز فيه الإشمام، وهو ما كان متحركا بالخفض أو الكسر مثل: الرَّحْمَنِ الرَّحِيمِ ، هَؤُلاءِ .  ما يوقف عليه بالسكون فقط ولا يجوز فيه الروم والإشمام، وذلك في المواضع الآتية : أ. المنصوب والمفتوح نحو: الْمُسْتَقِيمَ لا رَيْبَ  فلا يجوز الروم 
فيهما لخفة الفتحة وسرعتها في النطق، فلا تكاد تخرج إلا كاملة، ولا الإشمام؛ لأنه إشارة إلى الضم.   ب. هاء التأنيث الموقوف عليها بالهاءمثل: الْجَنَّةَ إذ المراد من الروم والإشمام بيان حركة الموقوف عليه حالة الوصل، ولم يكن على الهاء حركة حالة الوصل؛ لأنها مبدلة من التاء، والتاء معدومة في الوقف. ج .ما كان ساكنا في الوصل مثل: فَلا تَنْهَرْ ومنه ميم الجمع، فلا يجوز فيه الروم والإشمام؛ لأنهما إنما يكونان في المتحرك دون الساكن. د. ما كان متحركا في الوصل بحركة عارضة مثل: وَأَنْذِرِ النَّاسَ، وَلا تَنْسَوُا الْفَضْلَ لأن الحركة عرضت للراء، والواو للتخلص من التقاء الساكنين.  ومثل ذلك ميم الجمع نحو: وَأَنْتُمُ الأَعْلَوْنَ فلا يجوز فيه الروم والإشمام لعروض الحركة، فلا يعتد بها؛ لأنها تزول في الوقف لذهاب المقتضي وهو اجتماع الساكنين، فلا وجه للروم، والإشمام. ',
            'ruling_letters' => '',
            'pronunciation_method' => '',
            'example' => 'نَسْتَعِينُ ، مِنْ قَبْلُ وَمِنْ بَعْدُ  ,  الرَّحْمَنِ الرَّحِيمِ ، هَؤُلاءِ . ,  الْمُسْتَقِيمَ لا رَيْبَ  , الْجَنَّةَ ,  فَلا تَنْهَرْ , وَأَنْذِرِ النَّاسَ، وَلا تَنْسَوُا الْفَضْلَ ,  ميم الجمع نحو: وَأَنْتُمُ الأَعْلَوْنَ',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],


            [
                'category_id' => 15, // Reference to the "tajweed_categories" table
                'ruling_name' => 'هاء الضمير وقفا ',
                'ruling_description' => ' فذهب بعضهم إلى جواز الروم والإشمام فيها مطلقا. وذهب بعضهم إلى المنع مطلقا والمختار منعهما فيها إذا كان قبلها ضم، أو واو ساكنة، أو كسر، 
أو ياء ساكنة مثل: يَرْفَعُهُ ، و عَقَلُوهُ ، و بِهِ ، و فِيهِ .  ووجه المنع طلب الخفة.  وجوازهما إذا لم يكن قبلها ذلك، بأن انفتح ما قبل الهاء، أو وقع قبلها ألف، أو ساكن صحيح مثل: فَأَكْرَمَهُ ، وَهَدَاهُ ، وعَنْهُ .  ووجه الروم والإشمام الإجراء على القاعدة ',
                'ruling_letters' => '',
                'pronunciation_method' => '',
                'example' => 'يَرْفَعُهُ ، و عَقَلُوهُ ، و بِهِ ، و فِيهِ .',
                'note' => '',
                'created_at' => now(),
                'updated_at' => now(),
                ],


                [
                    'category_id' => 15, // Reference to the "tajweed_categories" table
                    'ruling_name' => ' هاء الضمير وصلا',
                    'ruling_description' => 'لما كانت هاء الضمير في اصطلاح القراء: هي الهاء الزائدة الدالة على الواحد المذكر الغائب، سميت هاء الكناية أيضا لأنها يكنى بها عن المفرد والمذكر الغائب ، ولها أربع أحوال: الحالة الأولى: أن تقع بعد متحرك وقبل ساكن نحو:لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ  الحالة الثانية: أن تقع بين ساكنين نحو: شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ .وقد اتفق القراء العشرة على عدم صلة هاء الضمير في هاتين الحالتين إلا البزي عن ابن كثير في قوله تعالى: فَأَنْتَ عَنْهُ تَلَهَّى  فإنه يصل الهاء بواو لفظية في الوصل، ويشدد التاء من "تلهى"، ويلزم حينئذ مد الهاء مدا طويلا لوجود الساكن المدغم. الحالة الثالثة: أن تقع بين متحركيننحو: إِنَّ رَبَّهُ كَانَ بِهِ بَصِيرًا  ولا خلاف بين عامة القراء في صلة هذه الهاء بواو لفظية في الوصل إذا كانت مضمومة، وبياء لفظية في الوصل إذا كانت مكسورة. الحالة الرابعة: أن تقع بعد ساكن، وقبل متحرك نحو: فِيهِ هُدًى لِلْمُتَّقِينَ وهذه الحالة مختلف فيها بين القراء العشرة، فابن كثير يصلها بواو إذا كانت مضمومة، وبياء إذا كانت مكسورة، ويوافقه حفص في لفظ فِيهِ مُهَانًا  بالفرقان، فيصل الهاء من "فيه" بياء لفظية في الوصل، وباقي القراء بالقصر أي بحذف الصلة مطلقا، ولا خلاف بين القراء في إسكان الهاء وقفا. ',
                    'ruling_letters' => '',
                    'pronunciation_method' => '',
                    'example' => '',
                    'note' => '',
                    'created_at' => now(),
                    'updated_at' => now(),
                    ],


           // ========================== صفات الحروف التي لا ضد لها =======================================
           
           [
            'category_id' => 16, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الصفير',
            'ruling_description' => 'وهو صوت زائد يصاحب أحرفه الثلاثة، وسميت بالصفير لأنك تسمع لها صوتاً يشبه صفير الطائر.',
            'ruling_letters' => 'وحروفه ثلاثة: (ص، س، ز).',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],

           [
            'category_id' => 16, // Reference to the "tajweed_categories" table
            'ruling_name' => 'القلقلة',
            'ruling_description' => 'وهو اضطراب المخرج عند النطق بالحرف ساكناً حتى يسمع له نبرة قوية، والسبب في هذا الاضطراب والتحريك شدة حروفها لما فيها من جهر وشدة',
            'ruling_letters' => 'وحروفها: (قُطُبُ جَدٍ).',
            'pronunciation_method' => '',
            'example' => 'بالحقِّ',
            'note' => 'وأعلى مراتب القلقة الطاء، وأوسطها الجيم، وأدناها الباقي. ويجب بيانها في حالة الوقوف أكثر، وخاصة حالة الوقف على الحرف المشدد، نحو: بالحقِّ. ',
            'created_at' => now(),
            'updated_at' => now(),
            ],

            [
            'category_id' => 16, // Reference to the "tajweed_categories" table
            'ruling_name' => 'اللين',
            'ruling_description' => 'وهو إخراج الحرف في لين وعدم كلفة على اللسان',
            'ruling_letters' => 'وحروفه الواو والياء المفتوح ما قبلهما.',
            'pronunciation_method' => '',
            'example' => 'البيت، خوف',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 16, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الانحراف',
            'ruling_description' => 'وهو ميلان الحرف في مخرجه حتى يتصل بمخرج غيره، فميلان اللام يكون من طرف اللسان وميلان الراء يكون من ظهره',
            'ruling_letters' => 'حروفه: اللام والراء.',
            'pronunciation_method' => '',
            'example' => 'البيت، خوف',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 16, // Reference to the "tajweed_categories" table
            'ruling_name' => 'التكرير',
            'ruling_description' => 'هو ارتعاد رأس اللسان عند النطق بالحرف، وتوصف الراء بالتكرير لقابليتها له إذا كانت مشددة، ثم إن كانت ساكنة.',
            'ruling_letters' => 'حرف التكرار هو الراء.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => 'وينبغي تجنب تكرير الراء، بأن يلصق لافظها ظهر اللسان بأعلى الحنك لصقاً محكماً، بحيث تخرج الراء مرة واحدة ولا يرتعد اللسان بها. ',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 16, // Reference to the "tajweed_categories" table
            'ruling_name' => 'التفشي',
            'ruling_description' => 'ومعنى التفشي: انتشار خروج النفس بين اللسان والحنك وانبساطه في الخروج عند النطق بالحرف. ووصفت الشين بهذه الصفة لأنها تنبث وتنتشر في الفم عند النطق بها لرخاوتها.',
            'ruling_letters' => 'حرفه الوحيد هو الشين.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => 'وينبغي تجنب تكرير الراء، بأن يلصق لافظها ظهر اللسان بأعلى الحنك لصقاً محكماً، بحيث تخرج الراء مرة واحدة ولا يرتعد اللسان بها. ',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 16, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الاستطالة',
            'ruling_description' => 'معنى الاستطالة: امتداد الصوت من أول حافة اللسان إلى آخرها. ',
            'ruling_letters' => 'حرفها الوحيد هو الضاد.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => 'وعند نطق "ا ض" يطبق اللسان على سقف الحنك تدريجياً من الأمام إلى الخلف، ويتخامد الصوت ويبقى جريانه يسمع متضائلاً مدة أقل من الحركتين بقليل، ويخرج من إحدى حافتي اللسان أو من كلتيهما معاً.',
            'created_at' => now(),
            'updated_at' => now(),
            ],


                       // ========================== صفات الحروف التي لها ضد =======================================


            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الهمس',
            'ruling_description' => 'جريان النّفَس عند النطق بالحرف لضعف الاعتماد على المخرج.',
            'ruling_letters' => 'حروف الهمس عشر تجمعها جملة: فحثَّه شخص سكت.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الجهر',
            'ruling_description' => 'انحباس جريان النّفَس عند النطق بالحرف لقوة الاعتماد على المخرج.',
            'ruling_letters' => 'باقي الحروف يجمعها: عَظُمَ وَزْن قارىء ذي غضّ جِدّ طَلَب.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الشدة',
            'ruling_description' => 'انحباس جريان النّفَس عند النطق بالحرف لقوة الاعتماد على المخرج.',
            'ruling_letters' => 'باقي الحروف يجمعها: عَظُمَ وَزْن قارىء ذي غضّ جِدّ طَلَب.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الرخاوة',
            'ruling_description' => 'ومعنى الرخاوة: جريان الصوت مع الحرف.',
            'ruling_letters' => 'حروف الرخاوة : باقي الحروف وهي : ح، خ، ذ، ز، ث، س، ش، ا، ص، ض، و، غ، ف، هـ، ي.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => 'ذا انحصر صوت الحرف في مخرجه انحصاراً تاماً، فلا يجري جرياناً أصلاً ، سمي شديداً ، فإنك لو وقفت على قولك: " الحج" وجدت صوتك راكداً محصوراً. حتى لو أردت مد صوتك لم يمكنك.',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'التوسط',
            'ruling_description' => 'التوسط فلا ينحبس الصوت عند النطق بأحد حروفه كانحباسه في أحرف الشدة ولا هو يجري كجريانه مع أحرف الرخاوة.',
            'ruling_letters' => 'حروف التوسط بين الشدة والرخاوة خمسة يجمعها قولهم: لِنْ عُمر',
            'pronunciation_method' => '',
            'example' => '',
            'note' => 'ذا لم يتم الانحصار ولا الجري فيكون متوسطاً بين الشدة والرخاوة كما في " الظل" فإنك لو وقفت عليه وجدت الصوت لا يجري مثل جري " الطش " ولا ينحصر مثل انحصار " الحج" بل يخرج على حد الاعتدال بينهما.',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الاستعلاء',
            'ruling_description' => 'معنى الاستعلاء: ارتفاع اللسان عند النطق بالحرف إلى الحنك الأعلى.',
            'ruling_letters' => 'حروف الاستعلاء سبعة، يجمعها قولهم: خُصَّ ضَغْطٍ قِظْ.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الاستفال',
            'ruling_description' => 'معنى الاستفال: انحطاط اللسان عند خروج الحرف إلى قاع الفم.',
            'ruling_letters' => 'حروف الاستفال باقي الحروف، يجمعها قولهم: ثَبَتَ عِزّ مّنْ يُجَوّدْ حَرْفَهُ إذ سَلَّ شَكا.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الاطباق',
            'ruling_description' => 'معنى الإطباق: هو إلصاق اللسان بالحنك الأعلى عند النطق بالحرف.',
            'ruling_letters' => 'حروف الإطباق: ص، ض، ط، ظ.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الانفتاح',
            'ruling_description' => 'معنى الانفتاح: هو افتراق اللسان عن الحنك الأعلى، وعدم التصاقه به حال النطق بالحرف.',
            'ruling_letters' => 'حرف الانفتاح: باقي الحروف.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الاذلاق',
            'ruling_description' => 'وسميت حروف الذلاقة لسرعة النطق بها وخروجها من طرف اللسان. ',
            'ruling_letters' => 'حروف الإذلاق: ستة مجموعة في قولهم: فر من لب.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],
            [
            'category_id' => 17, // Reference to the "tajweed_categories" table
            'ruling_name' => 'الصمت',
            'ruling_description' => 'وسميت حروف الإصمات بهذا لامتناع انفراد هذه الحروف أصولاً في الكلمات الرباعية أو الخماسية، فلا بد من وجود حرف أو أكثر من حروف الإذلاق في الكلمات الرباعية أو الخماسية، فإن أنت لم تجد في كلمة رباعية الأصل أو خماسية حرف إذلاق فاحكم بأنها كلمة غير عربية.',
            'ruling_letters' => 'حروف الإصمات: باقي حروف الهجاء.',
            'pronunciation_method' => '',
            'example' => '',
            'note' => '',
            'created_at' => now(),
            'updated_at' => now(),
            ],



   ] );
    }
}
