<?php

namespace Database\Seeders;

use App\Models\SeekingRefuge;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SeekingRefugeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        SeekingRefuge::create([
            'formula' => 'أعوذ بالله من الشيطان الرجيم" موافقة لآية "النحل" وهي قوله جل وعلا  فَإِذَا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ  ويجوز الزيادة على هذه الصيغة، أو النقص عنها، أو الإتيان بصيغة أخرى مغايرة مما صح عند أئمة القراءة. فمما ورد في الزيادة: " أعوذ بالله السميع العليم من الشيطان الرجيم". ومما ورد في ',
            'ruling' => 'هي مستحبة عند الأكثر، وقيل: واجبة',
            'cases' => 'لها ست حالات: حالتان يجهر بها فيهما، وأربع حالات يسر بها فيها، فيجهر بها القارئ إذا كان هناك من يسمعه، أو في ابتداء الدرس، ويسر بها إذا أسر قراءته، أو كان في الصلاة، أو كان خاليا سواء أقرأ سرا أم جهرا، أو كان يقرأ وسط جماعة يتدارسون القرآن، ولم يكن هو المبتدئ بالقراءة.',
            'placement' => 'إنما تكون قبل القراءة، وهذا هو الصحيح، وقيل: بعدها لظاهر الآية، وهو ضعيف لأن تقدير الآية: فإذا أردت القراءة فاستعذ كما في قوله تعالى:  إِذَا قُمْتُمْ إِلَى الصَّلاةِ فَاغْسِلُوا  أي: إذا أردتم القيام إلى الصلاة. ',
            'note' => 'إذا قطع القارئ القراءة لعارض ضروري كسعال، أو لكلام يتعلق بالقراءة لم يعد التعوذ بخلاف ما إذا قطعها إعراضا عنها، أو لكلام أجنبي ولو رداً لسلام فإنه يعيده.',
        ]);
    }
}
