<?php

namespace Database\Seeders;

use App\Models\TajweedDefinition;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class TajweedDefinitionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        TajweedDefinition::create([
            'definition' => 'علم التجويد من أفضل العلوم على الإطلاق، لأنه متعلق بأفضل الكلام وهو كلام الله جل وعلا، ولذلك كان تعلمه قربة وأجر وعبادة يتقرب به إلى الله تعالى، وبنص حديث رسول الله --:" خيركم من تعلم العلم وعلمه"().صحيح البخاري: لأبي عبد الله محمد بن إسماعيل، ت 256هـ، مطبعة دار بن كثير، اليمامة، مراجعة، د: مصطفى ديب البغا،1407 هـ، (ج4/ص1919)، باب: خيركم من تعلم القرآن وعلمه. ',
            'evidence_from_quran' => 'عملا بقوله تعالى:  الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَتْلُونَهُ حَقَّ تِلاَوَتِهِ أُوْلَئِكَ يُؤْمِنُونَ بِهِ وَمن يَكْفُرْ بِهِ فَأُوْلَئِكَ هُمُ الْخَاسِرُونَ  ().سورة البقرة، آية (121).',
            'linguistic_meaning' => ' هو التحسين. تقول: جودت الشيء إذا حسنته.',
            'terminological_meaning' => 'إعطاء كل حرف حقه ومستحقه. وحق الحرف: إخراجه من مخرجه متصفا بصفاته الذاتية اللازمة له، كالجهر، والشدة، والاستعلاء، والغنة، وغيرها، فإن هذه الصفات المذكورة وغيرها من الصفات اللازمة لا تنفك عن الحرف. 
ومستحقه: صفاته العارضة الناشئة عن الصفات اللازمة، كالتفخيم فإنه ناشئ عن الاستعلاء، وكالترقيق فإنه ناشئ عن الاستفال.',
            'ruling' => 'العلم به فرض كفاية، والعمل به فرض عين على كل مسلم ومسلمة. وقد ثبتت فرضيته بالكتاب والسنة والإجماع.',
            'virtue' => 'من أشرف العلوم لتعلقه بأشرف الكتب وأجلها.',
            'purpose' => ' صون اللسان عن اللحن في كتاب الله .والمراد باللحن هنا الخطأ، والميل عن الصواب، وهو قسمان: جلي، وخفي.',
            'method_of_learning_tajweed' => 'طريقة أخذ علم التجويد على نوعين : 1.  أن يسمع الآخذ من الشيخ، وهي طريقة المتقدمين. 2.  أن يقرأ الآخذ في حضرة الشيخ وهو يسمع له ويصحح. 
والأفضل الجمع بين الطريقتين.',
        ]);
    }
}
